/* ================================================================================================== */
/* DBMS name:      PostgreSQL 8                                                                       */
/* Created on:     10.02.2015 18:25:11                                                                */
/* -------------------------------------------------------------------------------------------------- */
/*  2015-03-19     Дополнения                                                                         */ 
/* -------------------------------------------------------------------------------------------------- */
/*  2015-05-29     Переношу в COM  nso_domain_column                                                  */
/*                 Добавляю краткий код в заголовок НСО                                               */
/*  2015_06_16 Модификация nso_blob                                                                   */
/*  2015_07_04 Index: ak1_nso_column_head   Убрал Nick.                                               */
/*  2015-07-27 Убрал всё, что относится к обмену данными.                                             */ 
/*  2015-09-24 Новое событие, создание данных                                                         */
/*  2015-10-06 nso_ref.ref_rec_id  null  Nick                                                         */
/* -------------------------------------------------------------------------------------------------- */
/* 2016-04-01 Gregory Добавляем атрибуты "date_from", "date_to"                                       */
/*              в nso_column_head, nso.nso_key_attr                                                   */
/* -------------------------------------------------------------------------------------------------- */
/* 2016-05-16 Nick добавлены события экспорта и импорта НСО.                                          */
/* 2016-05-28 Nick Общая sequence для всех исторических таблиц.                                       */
/* -------------------------------------------------------------------------------------------------- */
/* 2016-07-14 Gregory & Nick nso_object.                                                              */ 
/* unique_check boolean_t DEFAULT false. Признак контроля уникальности.                               */
/*  ------------------------------------------------------------------------------------------------  */
/*  2016-07-19 Nick добавлены события  включения контроля уникальности,                               */ 
/*                  выключения контроля уникальности.                                                 */
/* -------------------------------------------------------------------------------------------------- */
/* 2016-11-07 Nick  Общая последовательность для исторических таблиц и LOG.                           */
/*      Все LOG таблицы наследуют от "ALL_LOG".                                                       */
/* -------------------------------------------------------------------------------------------------- */
/* 2016-11-12 Nick, Абсолютное значение типа t_text (t_arr_values -> t_arr_text, t_str2048 -> t_text) */
/* -------------------------------------------------------------------------------------------------- */
/* 2017-01-25 Nick  Impact_descr типа t_text                                                          */
/* -------------------------------------------------------------------------------------------------- */
/* 2017-05-26 Nick  ak1_nso_column_head UNIQUE ( nso_id, col_code );                                  */
/* -------------------------------------------------------------------------------------------------- */
/* 2018-01-29 Nick nso_log нет собственных атрибутов.                                                 */
/* 2018-12-18 Nick Новый проект.                                                                      */ 
/* -------------------------------------------------------------------------------------------------- */
/* 2019-05-29 Nick Новое ядро, "nso_abs"  секционируется, "nso_blob" - под вопросом                   */ 
/* -------------------------------------------------------------------------------------------------- */
/* 2019-07-11 Nick Новое ядро,  Декларативное секционирование "nso_data.nso_abs".                     */
/*      Дополнительный атрибут "nso_strct.nso_object.section_number".                                 */
/*      Отдельная сущность "nso_data_section", "section_number"  <->  "section_sign".                 */
/*      Функционал на базе этой сущности обеспечивает создание секций, удаление,                      */
/*      создание PK, индексов, триггерных функций.                                                    */
/*            "nso_data.nso_record" получает дополнительный атрибут "section_sign".                   */
/*            "nso_data.nso_abs" получает дополнительный атрибут "section_sign".                      */
/*      Все функции отображения пересматриваются и в выражении участвует "section_sign".              */
/*      Секция №0 сушествуетт всегда, остальные по мере необходимости.                                */
/*      Секционируется и "nso_data.nso_blob", иначе будет сильно тормозить запросы.                   */
/* -------------------------------------------------------------------------------------------------- */
/*  2020-01-16 Начальные секции                                                                       */
/*  2020-01-21 Номер секции является единственным атрибутом, section_sign - исключается               */
/*             section_number имеет нативный тип "int2"                                               */
/* -------------------------------------------------------------------------------------------------- */
/*  2020-04-07 Nick Не забывать про установку имени схемы (по умолчанию) в LOG-таблицах.              */
/* ---------------------------------------------------------------------------------------------------*/
/* Nick 2020-04-30     Журнал - декларативное секционирование,                                        */
/*====================================================================================================*/
SET search_path=nso,com,public,pg_catalog;

-- Дополнительные секции

CREATE TABLE nso.nso_log_1_19 PARTITION OF nso.nso_log_1
       FOR VALUES FROM ('2019-01-01 00:00:00') TO ('2019-12-31 23:58:50')
    PARTITION BY LIST (impact_type);   
COMMENT ON TABLE nso.nso_log_1_19 IS 'Схема NSO. Журнал регистрации операций и ошибок. 2019 год';
    -- 
CREATE TABLE nso.nso_log_1_20 PARTITION OF nso.nso_log_1
       FOR VALUES FROM ('2020-01-01 00:00:00') TO ('2020-12-31 23:58:50')
    PARTITION BY LIST (impact_type);
COMMENT ON TABLE nso.nso_log_1_20 IS 'Схема NSO. Журнал регистрации операций и ошибок. 2020 год';
--      --
CREATE TABLE nso.nso_log_1_19_op PARTITION OF nso.nso_log_1_19 
       FOR VALUES IN 
         ('0','1','2','3','4','5','X','8','9','A','B','C','D','E','F','G','H','Y','Z','I','J','6','7');
COMMENT ON TABLE nso.nso_log_1_19_op IS 'Схема NSO. Журнал регистрации операций. 2019 год';         
 -- 
CREATE TABLE nso.nso_log_1_19_er PARTITION OF nso.nso_log_1_19 FOR VALUES IN ('!');
COMMENT ON TABLE nso.nso_log_1_19_er IS 'Схема NSO. Журнал регистрации ошибок. 2019 год';
--      --
CREATE TABLE nso.nso_log_1_20_op PARTITION OF nso.nso_log_1_20 
       FOR VALUES IN 
         ('0','1','2','3','4','5','X','8','9','A','B','C','D','E','F','G','H','Y','Z','I','J','6','7');
COMMENT ON TABLE nso.nso_log_1_20_op IS 'Схема NSO. Журнал регистрации операций. 2020 год';         
--
CREATE TABLE nso.nso_log_1_20_er PARTITION OF nso.nso_log_1_20 FOR VALUES IN ('!');
COMMENT ON TABLE nso.nso_log_1_20_er IS 'Схема NSO. Журнал регистрации ошибок. 2020 год';

