#!/bin/bash
# --------------------------------------------------------
# 2023-02-19 The upgrade.  Nick  
# 2023-08-06  "unnsi_prd_test will upgraded".
# file: load_updates.sh
# Remarks: Игнорировать  файлы типа "md5"
# --------------------------------------------------------
#
## ----------------------------------------------------- ##
##     Общие переменные устанавливать только вручную     ##
## ----------------------------------------------------- ##
WD=/tmp  # Рабочий каталог, сюда должен попасть архив с обновлениямим

Z5=$(ls /tmp/up_prds_*tar.gz.md5)

ZM=$(ls -tr1 /tmp/up_prds_*tar.gz)
if [ $? -ne 0 ] 
  then
    exit 1
fi

# Маска имени архива ???
IP=127.0.0.1               # IP сервера БД
PT=5432                    # Порт сервера БД
UM=postgres                # Имя пользователя
DB=unnsi_prd_test          # Имя базы
## ----------------------------------------------------- ##
##  УСТАНОВИТЬ И НЕ МЕНЯТЬ БЕЗ ОСОБОЙ НЕОБХОДИМОСТИМ     ##
## ----------------------------------------------------- ##

cd $WD

# 1. Удаление мусора
for x5 in $Z5 
do
  rm $x5
done
 
# 2. Распаковка архива 
for xz in $ZM 
do
  tar -xvzf $xz
  if [ $? -ne 0 ] 
    then
      exit 1
  fi
  rm $xz
done

## ----------------------------------------------------- ##
##     Общие переменные устанавливать только вручную     ##
## ----------------------------------------------------- ##
ZD=$(ls -dtr1 /tmp/up_prds_????????)    # Только каталоги.  
if [ $? -ne 0 ] 
  then
    exit 1
fi
## ----------------------------------------------------- ##
##  УСТАНОВИТЬ И НЕ МЕНЯТЬ БЕЗ ОСОБОЙ НЕОБХОДИМОСТИМ     ##
## ----------------------------------------------------- ##

# 3. Загрузка обновлений каждое обновление это каталог.
for zw in $ZD
do 
  if [ -d $zw ]
  then
  
    cd $zw
    . load_upd_wi.sh $IP $PT $UM $DB
    
    cp -v process.err $zw.err 
    cp -v process.out $zw.out
    
    rm -R $zw
  
  fi
done
 
cd $WD
exit 0
