SELECT id_street, id_area, nm_street, id_street_type, nm_street_full, nm_fias_guid, dt_data_del, id_data_etalon, kd_kladr, vl_addr_latitude, vl_addr_longitude, id_street_hist, date_create, f_server_name, id_region
FROM gar_tmp.adr_street_hist WHERE (nm_street = 'Садовая');
-- 931568|192331|'Садовая'|38|'Садовая ул.'|'806c00f0-64b1-496b-ac23-143664ef687d'|'2023-01-08 20:16:11.569228'|931568

SELECT * FROM gar_tmp.adr_street WHERE (id_street = 931568);
-- 931568|192331|'Садовая'|38|'Садовая ул.'|'31524a8d-f5df-4a22-9697-1791caf72692'

SELECT h.id_street, h.id_area, h.nm_street, h.id_street_type, h.nm_street_full, h.nm_fias_guid, h.dt_data_del, h.id_region, 
       s.id_area, s.nm_street, s.id_street_type, s.nm_street_full, s.nm_fias_guid 
FROM gar_tmp.adr_street_hist h
 INNER JOIN gar_tmp.adr_street s ON ( h.id_street = s.id_street)

WHERE NOT (h.nm_fias_guid = s.nm_fias_guid)
ORDER BY s.id_area, s.nm_street, s.id_street_type, h.dt_data_del DESC;

SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '4ce0359d-938d-4a42-bd7e-ff33e814e4bc')  
UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '99a575f6-6ae6-4781-a529-561179501293');  
--------------------------------------------------------------------------------------------------------------------------------------------------------
--   104675|    86648|'4ce0359d-938d-4a42-bd7e-ff33e814e4bc'|   243171|'Садовая'|204|'ул' |8|30|104634|     0|'2018-01-13'|'2015-03-28'|'2079-06-06'|t|f
--   104634|    86648|'4ce0359d-938d-4a42-bd7e-ff33e814e4bc'|   243114|'Садовая'|204|'ул' |8|10|     0|104675|'2017-12-26'|'2015-03-27'|'2015-03-28'|f|f
-- 52042846|158405482|'99a575f6-6ae6-4781-a529-561179501293'|498675740|'Садовая'|205|'ул.'|8|10|     0|     0|'2023-03-27'|'2023-03-27'|'2079-06-06'|t|t
-- -----------------------------------------------------------------------------------------------------------------------------------------------------
SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('4ce0359d-938d-4a42-bd7e-ff33e814e4bc'); -- НЕТ
SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('99a575f6-6ae6-4781-a529-561179501293'); -- НЕТ
------------------------------------------------------------------------------------------------
-- 158405482|84516|'99a575f6-6ae6-4781-a529-561179501293'|'024189e9-9f46-4347-a8fe-41cf2d2586d1'|'Садовая'|205|'ул.'|8|'Элемент улично-дорожной сети'|'5'|498675740|0|10|'Добавление'|'2023-03-27'|'2079-06-06'|t|t|'{158405482}'|0
-- 84516|83462|'024189e9-9f46-4347-a8fe-41cf2d2586d1'|'35f01ea7-5e6d-42ec-9dd3-0bf62002ff17'|'Хазар'|103|'с'|6|'Населенный пункт'|'5'|237768|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516}'|-1
-- 83462|78545|'35f01ea7-5e6d-42ec-9dd3-0bf62002ff17'|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|'Дербентский'|23|'р-н'|2|'Административный район'|'5'|235021|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516,83462}'|-2
-- 78545|0|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|''|'Дагестан'|13|'Респ'|1|'Субъект РФ'|'5'|222788|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516,83462,78545}'|-3
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '4ce0359d-938d-4a42-bd7e-ff33e814e4bc'::uuid, p_qty := 0) ; -- нет
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '99a575f6-6ae6-4781-a529-561179501293'::uuid, p_qty := 0) ; 
--
--  Обновлению UUID произошло один раз.
--   Теперь многократное обновление
--  

-- 931568	192331	Садовая	38	Садовая ул.	806c00f0-64b1-496b-ac23-143664ef687d	2023-10-25 11:05:35.035649	0	192331	Садовая	38	Садовая ул.	31524a8d-f5df-4a22-9697-1791caf72692
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '806c00f0-64b1-496b-ac23-143664ef687d')  
     UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '31524a8d-f5df-4a22-9697-1791caf72692');  

-- 97720|81088|'806c00f0-64b1-496b-ac23-143664ef687d'|229421|'Садовая'|204|'ул'|8|10|0|0|'2018-09-20'|'2016-10-19'|'2079-06-06'|t|t
-- 93774|77883|'31524a8d-f5df-4a22-9697-1791caf72692'|221038|'Садовая'|204|'ул'|8|10|0|0|'2018-03-12'|'2013-04-09'|'2079-06-06'|t|t

-- 931568	192331	Садовая	38	Садовая ул.	806c00f0-64b1-496b-ac23-143664ef687d	2023-10-25 11:05:35.035649	0	192331	Садовая	38	Садовая ул.	31524a8d-f5df-4a22-9697-1791caf72692

SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('806c00f0-64b1-496b-ac23-143664ef687d');
------------------------------------------------------------------------------------------------
-- 81088|84653|'806c00f0-64b1-496b-ac23-143664ef687d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'
-- 78727|78545|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|'Махачкала'|28|'г'|5|'Город'
-- 78545|0|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|''|'Дагестан'|13|'Респ'|1|'Субъект РФ'

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '727cdf1e-1b70-4e07-8995-9bf7ca9abefb'::uuid, p_qty := 1) ; -- 23
---------------------------------------------------------------------------------------------------------------------------------------
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4093'|'0'|238149|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84653|'{78727,84653}'|2
-- 75729|78727|'6a5b8826-dc74-4694-bbba-776daa464be1'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'31'|'0'|'0'|214539|91108|20|'Изменение'|'2012-12-25'|'2079-06-06'|84653|'{78727,75729}'|2
-- 75661|78727|'629a5247-b5e9-4abe-b420-ea7373a15cdc'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'29'|'0'|'0'|214342|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84783|'{78727,75661}'|2
-- 84783|78727|'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4052'|'0'|238516|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84783|'{78727,84783}'|2
-- 84564|78727|'8b8064d2-0262-4842-beca-0dc01360bd05'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3993'|'0'|237919|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84564|'{78727,84564}'|2
-- 75740|78727|'0f617717-1040-4742-bfb2-0eaaa040d4fa'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'32'|'0'|'0'|214567|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84564|'{78727,75740}'|2
-- 84454|78727|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3768'|'0'|237640|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84454|'{78727,84454}'|2
-- 75761|78727|'0e4ebdbe-e302-4237-94db-0c168f22b5db'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'33'|'0'|'0'|214694|91153|20|'Изменение'|'2012-12-25'|'2079-06-06'|84454|'{78727,75761}'|2
--
-- --- 2023-10-31  ---------------------------------------------------------------------------------------------------------------------------------
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'aece773e-5c5a-4dbe-8455-aa542f548704'::uuid, p_qty := 0) ORDER BY nm_addr_obj; --- 23
-----------------------------------------------------------------------------------------------------------------------------------------------------------
-- 80335|84653|'8a1525dd-b004-41ca-b8e9-14fa32fce57b'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'1-й Конечный'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4098'|227563|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80335|'{84653,80335}'|2
-- 87123|84653|'c3e86cc8-5dc1-4504-a7bb-6691dac09cb5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'1-й Локомотивной 2-й'|171|'пр-д'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4112'|244183|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87123|'{84653,87123}'|2
-- 80690|84653|'53207f1c-605a-4bd6-87f1-381baf36b7ce'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'1-я Локомотивная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4103'|228482|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80690|'{84653,80690}'|2
-- 80364|84653|'5c188757-5159-4044-8dea-06ec7e0c3630'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Конечный'|171|'пр-д'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4099'|227629|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80364|'{84653,80364}'|2
-- 87211|84653|'c105f543-3ed9-4ea7-a1c0-6e235f035539'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4113'|244384|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87211|'{84653,87211}'|2
-- 80757|84653|'7e156e07-9108-4acc-b029-82bd6bcb5771'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-я Локомотивная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4104'|228647|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80757|'{84653,80757}'|2
-- 80465|84653|'1de3983d-5e6b-4e25-b6ba-9805fb543379'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Конечный'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4100'|227897|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80465|'{84653,80465}'|2
-- 87289|84653|'0a33dc66-3cdc-469e-9f6e-2ddf1c42a33e'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4114'|244555|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87289|'{84653,87289}'|2
-- 80522|84653|'50e5f502-7bce-4314-8924-7fae3f49a540'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Конечный'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4101'|228059|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80522|'{84653,80522}'|2
-- 87375|84653|'45c00a79-a081-4c88-87dd-cecbc513525d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4115'|244737|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87375|'{84653,87375}'|2
-- 80601|84653|'19a51ad8-ad1b-47c2-b5fa-6b4db2ec9659'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'5-й Конечный'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4102'|228242|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80601|'{84653,80601}'|2
-- 80151|84653|'73b4b5d5-0977-4a37-9982-04d8fb5c739d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4094'|227090|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80151|'{84653,80151}'|2
-- 80209|84653|'502ff6ed-6854-4b57-a293-3ff7f0be4b3b'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4095'|227241|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80209|'{84653,80209}'|2
-- 80243|84653|'3fbb86d4-c4f1-449f-9c9a-66e277f829d5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4096'|227336|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80243|'{84653,80243}'|2
-- 80293|84653|'019d88e6-afae-4f11-bec7-9a9fc3e663a5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4097'|227476|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80293|'{84653,80293}'|2
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4093'|'0'|238149|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84653|'{84653}'|1
-- 80798|84653|'90aab9fa-8bad-4f0c-9859-7a0a0d181791'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4105'|228752|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80798|'{84653,80798}'|2
-- 80848|84653|'a04a5c83-fcde-4653-9795-8bb8dfe2b8c6'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4106'|228892|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80848|'{84653,80848}'|2
-- 80933|84653|'1b708347-9315-45e5-b0f7-44d0f4f5fcb7'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4107'|229081|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80933|'{84653,80933}'|2
-- 81014|84653|'2e657ab0-4e5c-4aa4-99de-62b3624b39b5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4108'|229245|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81014|'{84653,81014}'|2
-- 81088|84653|'806c00f0-64b1-496b-ac23-143664ef687d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4109'|229421|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81088|'{84653,81088}'|2
-- 81118|84653|'f3447545-3e2b-4084-b1c2-9333f0a34649'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4110'|229480|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81118|'{84653,81118}'|2
-- 81195|84653|'eea892d5-265c-4418-8c2a-7d237a93d3d8'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4111'|229659|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81195|'{84653,81195}'|2

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '6a5b8826-dc74-4694-bbba-776daa464be1'::uuid, p_qty := 0) ORDER BY nm_addr_obj;  20
-----------------------------------------------------------------------------------------------------------------------------------------------------------
-- 82776|75729|'2daaed0f-4c44-4332-8928-e93120385656'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'1-й Локомотивной 2-й'|176|'проезд'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'2'|233469|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|82776|'{75729,82776}'|2
-- 82827|75729|'b24a138d-ee8f-42fb-b05a-28ff84f937a2'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'3'|233588|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|82827|'{75729,82827}'|2
-- 77368|75729|'0cea9d82-4384-46d3-9a22-6d857a14f107'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'4'|219712|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77368|'{75729,77368}'|2
-- 77415|75729|'5296e770-88ab-40da-8df7-d5c1ae8f1f08'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'5'|219810|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77415|'{75729,77415}'|2
-- 77444|75729|'146d6237-c774-4542-9535-a8d4dd14def8'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'6'|219894|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|77444|'{75729,77444}'|2
-- 77511|75729|'049bd9f9-ebfa-4e6f-a07b-edb7f43994c6'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'7'|220052|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77511|'{75729,77511}'|2
-- 77530|75729|'e874d77b-eaae-4dd1-aae7-9e7a5de350ac'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'8'|220103|0|10|'Добавление'|'2014-11-20'|'2079-06-06'|77530|'{75729,77530}'|2
-- 77587|75729|'c65e14e4-9a94-4a64-8d71-406418463ce3'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'9'|220309|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77587|'{75729,77587}'|2
-- 77627|75729|'a6c21b50-1700-4974-93f5-db3c6aabec79'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Конечный 1-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'10'|220370|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77627|'{75729,77627}'|2
-- 75729|78727|'6a5b8826-dc74-4694-bbba-776daa464be1'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'31'|'0'|'0'|214539|91108|20|'Изменение'|'2012-12-25'|'2079-06-06'|75729|'{75729}'|1
-- 77655|75729|'764ef251-3c96-4ae6-902a-e339bfb25902'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Локомотивная 1-я'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'11'|220447|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77655|'{75729,77655}'|2
-- 77695|75729|'aa9a520a-f3c5-4f4e-8d7f-9c825d0d40a3'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Локомотивная 2-я'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'12'|220554|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77695|'{75729,77695}'|2
-- 77742|75729|'012d0b3f-b23f-46ee-86ca-348dfd33ada3'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'13'|220729|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77742|'{75729,77742}'|2
-- 77785|75729|'a2a088e3-f36f-4c07-b05b-b8b437f99253'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'14'|220791|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77785|'{75729,77785}'|2
-- 77839|75729|'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'15'|220949|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|77839|'{75729,77839}'|2
-- 77875|75729|'61eaa3be-b7ce-46d3-9a36-482cc401e065'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'16'|221020|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77875|'{75729,77875}'|2
-- 77883|75729|'31524a8d-f5df-4a22-9697-1791caf72692'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'17'|221038|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|77883|'{75729,77883}'|2
-- 77902|75729|'e5046070-a899-4aa6-b139-897670daa7fb'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Таежная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'18'|221071|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77902|'{75729,77902}'|2
-- 77916|75729|'68dd546f-b3b6-423b-a6b5-5f5032e4ce81'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'19'|221104|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|77916|'{75729,77916}'|2
-- 81320|75729|'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'1'|229978|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81320|'{75729,81320}'|2

----
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = 'eea892d5-265c-4418-8c2a-7d237a93d3d8')  
     UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '8d58ca8c-a65a-4370-a5d4-584f44ac5b73'); 
--
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '73b4b5d5-0977-4a37-9982-04d8fb5c739d')  
     UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '146d6237-c774-4542-9535-a8d4dd14def8');  
--

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '629a5247-b5e9-4abe-b420-ea7373a15cdc'::uuid, p_qty := 0) ORDER BY nm_addr_obj;      1   -- 214342
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'::uuid, p_qty := 0) ORDER BY nm_addr_obj;  -- 14   -- 238516

--
--   2023-10-31  Тестирование.
--
BEGIN;
   SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := NULL::uuid, p_qty := 1);  -- 10 
   ----------------------------------------------------------------------------------------------------
-- 74808|78621|'fe6f98aa-5009-434b-ac1d-2b25a6447d0b'|'1bde5cf4-7943-4b17-9718-2c1d96742be5'|'Пинхаскала'|199|'тер'|8|'Элемент улично-дорожной сети'|'5'|'0'|'6'|'0'|'0'|'237'|211506|89960|20|'Изменение'|'2014-01-01'|'2079-06-06'|82260|'{78545,78621,74808}'|3
-- 82260|78621|'0b89184c-17b8-4d17-87e9-063329bc2e5b'|'1bde5cf4-7943-4b17-9718-2c1d96742be5'|'Пинхаскала'|304|'тер'|7|'Элемент планировочной структуры'|'5'|'0'|'6'|'0'|'316'|'0'|232350|99191|50|'Переподчинение'|'2016-09-29'|'2079-06-06'|82260|'{78545,78621,82260}'|3
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4093'|'0'|238149|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84653|'{78545,78727,84653}'|3
-- 75729|78727|'6a5b8826-dc74-4694-bbba-776daa464be1'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'31'|'0'|'0'|214539|91108|20|'Изменение'|'2012-12-25'|'2079-06-06'|84653|'{78545,78727,75729}'|3
-- 75661|78727|'629a5247-b5e9-4abe-b420-ea7373a15cdc'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'29'|'0'|'0'|214342|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84783|'{78545,78727,75661}'|3
-- 84783|78727|'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4052'|'0'|238516|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84783|'{78545,78727,84783}'|3
-- 84564|78727|'8b8064d2-0262-4842-beca-0dc01360bd05'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3993'|'0'|237919|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84564|'{78545,78727,84564}'|3
-- 75740|78727|'0f617717-1040-4742-bfb2-0eaaa040d4fa'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'32'|'0'|'0'|214567|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84564|'{78545,78727,75740}'|3
-- 84454|78727|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3768'|'0'|237640|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84454|'{78545,78727,84454}'|3
-- 75761|78727|'0e4ebdbe-e302-4237-94db-0c168f22b5db'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'33'|'0'|'0'|214694|91153|20|'Изменение'|'2012-12-25'|'2079-06-06'|84454|'{78545,78727,75761}'|3
--
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_set_data" ( 
       p_fias_guid  := NULL::uuid     
      ,p_qty        := 1
      ,p_descr      := 'ТЕСТ. Дагестан'   
);      -- 10

SELECT * FROM gar_fias.gap_adr_area WHERE (date_create = current_date);

SELECT * FROM gar_fias_pcg_load."_NEW_f_addr_obj_update_children" ();

-- '0b89184c-17b8-4d17-87e9-063329bc2e5b'|'fe6f98aa-5009-434b-ac1d-2b25a6447d0b'|'ПИНХАСКАЛА'|199|15
-- '450279b7-39ac-4e99-a505-10dd7b675d3d'|'0e4ebdbe-e302-4237-94db-0c168f22b5db'|'УРОЖАЙ'|79|15
-- '8b8064d2-0262-4842-beca-0dc01360bd05'|'0f617717-1040-4742-bfb2-0eaaa040d4fa'|'САДОВОД'|79|13
-- 'aece773e-5c5a-4dbe-8455-aa542f548704'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'ЛОКОМОТИВ'|79|19
-- 'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'|'629a5247-b5e9-4abe-b420-ea7373a15cdc'|'НЕФТЕКАЧКА'|79|0

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '0b89184c-17b8-4d17-87e9-063329bc2e5b'::uuid, p_qty := 0); -- 1
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'fe6f98aa-5009-434b-ac1d-2b25a6447d0b'::uuid, p_qty := 0); -- 0
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '450279b7-39ac-4e99-a505-10dd7b675d3d'::uuid, p_qty := 0); -- 31
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '0e4ebdbe-e302-4237-94db-0c168f22b5db'::uuid, p_qty := 0); -- 0
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '8b8064d2-0262-4842-beca-0dc01360bd05'::uuid, p_qty := 0); -- 27
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '0f617717-1040-4742-bfb2-0eaaa040d4fa'::uuid, p_qty := 0); -- 0
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'aece773e-5c5a-4dbe-8455-aa542f548704'::uuid, p_qty := 0); -- 42
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '6a5b8826-dc74-4694-bbba-776daa464be1'::uuid, p_qty := 0); -- 0
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'::uuid, p_qty := 0); -- 14
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '629a5247-b5e9-4abe-b420-ea7373a15cdc'::uuid, p_qty := 0); -- 0


ROLLBACK;
-- d63feac3-6ae3-4d45-934c-f6b6516e20f2	2023-03-18 06:36:22.13846	0	192259	Ахульго	38	Ахульго ул.	5b8bba72-59a1-4e73-b917-848e7dd36c32
           CREATE INDEX IF NOT EXISTS ie3_as_adm_hierarchy ON gar_fias.as_adm_hierarchy 
                                     USING btree (object_id); 
       DROP INDEX IF EXISTS gar_fias.ie3_as_addr_obj ;

           CREATE INDEX IF NOT EXISTS ie3_as_addr_obj ON gar_fias.as_addr_obj    -- ???
                   USING btree (object_guid); 

       
EXPLAIN ANALYZE
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '450279b7-39ac-4e99-a505-10dd7b675d3d'::uuid, p_qty := 1); -- 31
--------------------------------------------------------------------------------------------------------------------------------------------
-- 79107|84454|'d63feac3-6ae3-4d45-934c-f6b6516e20f2'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'  |204|'ул'|8|'Элемент улично-дорожной сети'
-- 80724|84454|'5b8bba72-59a1-4e73-b917-848e7dd36c32'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'  |204|'ул'|8|'Элемент улично-дорожной сети'
-- 80758|84454|'fffd8162-a968-4f92-9a49-d691a8424848'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная' |204|'ул'|8|'Элемент улично-дорожной сети'
-- 79446|84454|'f81097f2-089a-4f04-9ec0-0f4a7682aa2b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная' |204|'ул'|8|'Элемент улично-дорожной сети'
-- 79527|84454|'c6cb27a2-32ab-4165-be89-bf03cdc9d461'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'
-- 80792|84454|'354baa65-215d-4df5-aec0-1b6dbfada0c9'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'
-- 79745|84454|'9e1bf45e-3edc-4766-ab42-daa5e908e55b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'
-- 81169|84454|'89e7b4b0-aa0c-4977-b631-79709c13a773'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'
WITH x (
          id_addr_obj_new
         ,id_addr_obj_old 
       )      
         AS (
                SELECT DISTINCT id_lead, min(id_addr_obj) OVER (PARTITION BY id_lead) 
                  FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '450279b7-39ac-4e99-a505-10dd7b675d3d'::uuid, p_qty := 1)
            )
    --SELECT * FROM x

-- 80724|79107
-- 80758|79446
-- 80792|79527
-- 81169|79745
            
        SELECT z1.object_guid  AS fias_guid_new 
              ,z1.obj_level 
              ,z2.object_guid  AS fias_guid_old 
              ,current_date
        FROM x
          INNER JOIN gar_fias.as_addr_obj z1 ON (z1.object_id = x.id_addr_obj_new)
          INNER JOIN gar_fias.as_addr_obj z2 ON (z2.object_id = x.id_addr_obj_old)          

-- '354baa65-215d-4df5-aec0-1b6dbfada0c9'|'c6cb27a2-32ab-4165-be89-bf03cdc9d461'
-- '89e7b4b0-aa0c-4977-b631-79709c13a773'|'9e1bf45e-3edc-4766-ab42-daa5e908e55b'
-- 'fffd8162-a968-4f92-9a49-d691a8424848'|'f81097f2-089a-4f04-9ec0-0f4a7682aa2b'
-- '5b8bba72-59a1-4e73-b917-848e7dd36c32'|'d63feac3-6ae3-4d45-934c-f6b6516e20f2'

-- ============================================================================
WITH x (
          id_addr_obj_new
         ,id_addr_obj_old 
       )      
         AS (
                SELECT DISTINCT id_lead, min(id_addr_obj) OVER (PARTITION BY id_lead) 
                  FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'aece773e-5c5a-4dbe-8455-aa542f548704'::uuid, p_qty := 1)
            )
    --SELECT * FROM x

-- 80724|79107
-- 80758|79446
-- 80792|79527
-- 81169|79745
            
        SELECT z1.object_guid  AS fias_guid_new 
              ,z2.object_guid  AS fias_guid_old 
        FROM x
          INNER JOIN gar_fias.as_addr_obj z1 ON (z1.object_id = x.id_addr_obj_new)
          INNER JOIN gar_fias.as_addr_obj z2 ON (z2.object_id = x.id_addr_obj_old)
----------------------------------------------------------------------------------          
-- '8d58ca8c-a65a-4370-a5d4-584f44ac5b73'|'eea892d5-265c-4418-8c2a-7d237a93d3d8'
-- '3fbb86d4-c4f1-449f-9c9a-66e277f829d5'|'e874d77b-eaae-4dd1-aae7-9e7a5de350ac'
-- '0a33dc66-3cdc-469e-9f6e-2ddf1c42a33e'|'0cea9d82-4384-46d3-9a22-6d857a14f107'
-- '45c00a79-a081-4c88-87dd-cecbc513525d'|'5296e770-88ab-40da-8df7-d5c1ae8f1f08'
-- '1b708347-9315-45e5-b0f7-44d0f4f5fcb7'|'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
-- '90aab9fa-8bad-4f0c-9859-7a0a0d181791'|'012d0b3f-b23f-46ee-86ca-348dfd33ada3'
-- '73b4b5d5-0977-4a37-9982-04d8fb5c739d'|'146d6237-c774-4542-9535-a8d4dd14def8'
-- '019d88e6-afae-4f11-bec7-9a9fc3e663a5'|'c65e14e4-9a94-4a64-8d71-406418463ce3'
-- '806c00f0-64b1-496b-ac23-143664ef687d'|'31524a8d-f5df-4a22-9697-1791caf72692'
-- 'a04a5c83-fcde-4653-9795-8bb8dfe2b8c6'|'a2a088e3-f36f-4c07-b05b-b8b437f99253'
-- 'f3447545-3e2b-4084-b1c2-9333f0a34649'|'68dd546f-b3b6-423b-a6b5-5f5032e4ce81'
-- 'c105f543-3ed9-4ea7-a1c0-6e235f035539'|'b24a138d-ee8f-42fb-b05a-28ff84f937a2'
-- '2e657ab0-4e5c-4aa4-99de-62b3624b39b5'|'61eaa3be-b7ce-46d3-9a36-482cc401e065'
-- '502ff6ed-6854-4b57-a293-3ff7f0be4b3b'|'049bd9f9-ebfa-4e6f-a07b-edb7f43994c6'

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := 'aece773e-5c5a-4dbe-8455-aa542f548704'::uuid, p_qty := 1);
-- 28

SELECT * FROM gar_fias.gap_adr_area WHERE id_addr_obj = 79107
 
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := NULL::uuid, p_qty := 1) ORDER BY parent_fias_guid;  -- 58
-------------------------------------------------------------------------------------------------------------------------------------
-- 79107|84454|'d63feac3-6ae3-4d45-934c-f6b6516e20f2'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3769'|224297|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80724|'{78545,78727,84454,79107}'|4
-- 80724|84454|'5b8bba72-59a1-4e73-b917-848e7dd36c32'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'2'|228567|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80724|'{78545,78727,84454,80724}'|4
-- 80758|84454|'fffd8162-a968-4f92-9a49-d691a8424848'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'3'|228649|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80758|'{78545,78727,84454,80758}'|4
-- 79446|84454|'f81097f2-089a-4f04-9ec0-0f4a7682aa2b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3774'|225132|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80758|'{78545,78727,84454,79446}'|4
-- 79527|84454|'c6cb27a2-32ab-4165-be89-bf03cdc9d461'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3775'|225349|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80792|'{78545,78727,84454,79527}'|4
-- 80792|84454|'354baa65-215d-4df5-aec0-1b6dbfada0c9'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'4'|228731|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80792|'{78545,78727,84454,80792}'|4
-- 81169|84454|'89e7b4b0-aa0c-4977-b631-79709c13a773'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'14'|229595|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|81169|'{78545,78727,84454,81169}'|4
-- 79745|84454|'9e1bf45e-3edc-4766-ab42-daa5e908e55b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3778'|226000|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81169|'{78545,78727,84454,79745}'|4
-- 82346|84564|'4399ca45-009d-41c2-b968-0f0065cd793c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Алисултанова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4724'|232456|0|10|'Добавление'|'2019-09-25'|'2079-06-06'|82694|'{78545,78727,84564,82346}'|4
-- 82694|84564|'0da140b2-b46d-4ef1-9174-574377b1e86b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Алисултанова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'13'|233270|0|10|'Добавление'|'2019-10-29'|'2079-06-06'|82694|'{78545,78727,84564,82694}'|4
-- 79353|84564|'75149768-0ba3-4f81-8e3f-46a227a41154'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3994'|224864|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81368|'{78545,78727,84564,79353}'|4
-- 81368|84564|'0dde2371-ae78-441c-a78f-46a510a484ca'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'1'|230086|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|81368|'{78545,78727,84564,81368}'|4
-- 81431|84564|'e31d0897-8a46-48d3-a213-7ae993c50de9'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'2'|230228|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81431|'{78545,78727,84564,81431}'|4
-- 79405|84564|'5cd754b0-2358-4afb-94da-136a378c0f0b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3995'|225010|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81431|'{78545,78727,84564,79405}'|4
-- 81458|84564|'7248f5e2-99b1-47e2-a5e4-190ea89df774'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ломаная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'3'|230344|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81458|'{78545,78727,84564,81458}'|4
-- 79493|84564|'e02001a5-132f-43da-a8f5-99a4464a9713'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ломаная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3996'|225256|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81458|'{78545,78727,84564,79493}'|4
-- 79541|84564|'ba5e3530-83f7-4896-b828-048f6342263a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3997'|225401|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81502|'{78545,78727,84564,79541}'|4
-- 81502|84564|'e8031e05-0550-4045-a587-cd5d9d41478d'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'4'|230414|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81502|'{78545,78727,84564,81502}'|4
-- 81531|84564|'bd7e3cec-c71c-4b96-8b67-7eec2651a8b8'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'5'|230484|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81531|'{78545,78727,84564,81531}'|4
-- 79628|84564|'8fc12041-e9ba-4e26-9017-b327128d6404'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3998'|225667|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81531|'{78545,78727,84564,79628}'|4
-- 79737|84564|'015bc036-5adc-44ba-953f-c98944ebdf3c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4000'|225942|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81643|'{78545,78727,84564,79737}'|4
-- 81643|84564|'c692373c-54e8-4f06-93a9-979b9b9c6f7c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'7'|230777|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81643|'{78545,78727,84564,81643}'|4
-- 79832|84564|'914e49d9-5ec0-48c3-93f3-2965ac004be3'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4001'|226217|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80221|'{78545,78727,84564,79832}'|4
-- 80221|84564|'bf24881d-00cb-460d-9ad5-b1359fac1b42'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'12'|227269|0|10|'Добавление'|'2017-08-14'|'2079-06-06'|80221|'{78545,78727,84564,80221}'|4
-- 81714|84564|'369aee13-6904-43a2-b3ab-15365e1655d1'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'9'|230940|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81714|'{78545,78727,84564,81714}'|4
-- 79948|84564|'2c0b4d68-c423-4da5-a3d1-7be1912ed5b1'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4003'|226569|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81714|'{78545,78727,84564,79948}'|4
-- 81776|84564|'64198789-a489-45d9-a15b-111f58d9009a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Финиковая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'10'|231074|0|10|'Добавление'|'2013-07-09'|'2079-06-06'|81776|'{78545,78727,84564,81776}'|4
-- 80011|84564|'802c73f6-749a-4ced-9c7e-9baf5017855b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Финиковая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4004'|226724|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81776|'{78545,78727,84564,80011}'|4
-- 80071|84564|'9724eb65-9e0f-4672-a9c1-fe7416aef368'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4005'|226885|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81795|'{78545,78727,84564,80071}'|4
-- 81795|84564|'2afcbebe-4123-4cf9-ab08-c98e134ef39a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'11'|231135|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81795|'{78545,78727,84564,81795}'|4
-- 82827|84653|'b24a138d-ee8f-42fb-b05a-28ff84f937a2'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'3'|233588|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87211|'{78545,78727,84653,82827}'|4
-- 87211|84653|'c105f543-3ed9-4ea7-a1c0-6e235f035539'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4113'|244384|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87211|'{78545,78727,84653,87211}'|4
-- 77368|84653|'0cea9d82-4384-46d3-9a22-6d857a14f107'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'4'|219712|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87289|'{78545,78727,84653,77368}'|4
-- 87289|84653|'0a33dc66-3cdc-469e-9f6e-2ddf1c42a33e'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4114'|244555|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87289|'{78545,78727,84653,87289}'|4
-- 87375|84653|'45c00a79-a081-4c88-87dd-cecbc513525d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4115'|244737|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87375|'{78545,78727,84653,87375}'|4
-- 77415|84653|'5296e770-88ab-40da-8df7-d5c1ae8f1f08'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'5'|219810|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87375|'{78545,78727,84653,77415}'|4
-- 77444|84653|'146d6237-c774-4542-9535-a8d4dd14def8'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'6'|219894|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80151|'{78545,78727,84653,77444}'|4
-- 80151|84653|'73b4b5d5-0977-4a37-9982-04d8fb5c739d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4094'|227090|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80151|'{78545,78727,84653,80151}'|4
-- 80209|84653|'502ff6ed-6854-4b57-a293-3ff7f0be4b3b'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4095'|227241|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80209|'{78545,78727,84653,80209}'|4
-- 77511|84653|'049bd9f9-ebfa-4e6f-a07b-edb7f43994c6'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'7'|220052|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80209|'{78545,78727,84653,77511}'|4
-- 80243|84653|'3fbb86d4-c4f1-449f-9c9a-66e277f829d5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4096'|227336|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80243|'{78545,78727,84653,80243}'|4
-- 77530|84653|'e874d77b-eaae-4dd1-aae7-9e7a5de350ac'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'8'|220103|0|10|'Добавление'|'2014-11-20'|'2079-06-06'|80243|'{78545,78727,84653,77530}'|4
-- 77587|84653|'c65e14e4-9a94-4a64-8d71-406418463ce3'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'9'|220309|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80293|'{78545,78727,84653,77587}'|4
-- 80293|84653|'019d88e6-afae-4f11-bec7-9a9fc3e663a5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4097'|227476|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80293|'{78545,78727,84653,80293}'|4
-- 80798|84653|'90aab9fa-8bad-4f0c-9859-7a0a0d181791'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4105'|228752|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80798|'{78545,78727,84653,80798}'|4
-- 77742|84653|'012d0b3f-b23f-46ee-86ca-348dfd33ada3'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'13'|220729|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80798|'{78545,78727,84653,77742}'|4
-- 80848|84653|'a04a5c83-fcde-4653-9795-8bb8dfe2b8c6'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4106'|228892|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80848|'{78545,78727,84653,80848}'|4
-- 77785|84653|'a2a088e3-f36f-4c07-b05b-b8b437f99253'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'14'|220791|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80848|'{78545,78727,84653,77785}'|4
-- 80933|84653|'1b708347-9315-45e5-b0f7-44d0f4f5fcb7'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4107'|229081|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80933|'{78545,78727,84653,80933}'|4
-- 77839|84653|'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'15'|220949|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|80933|'{78545,78727,84653,77839}'|4
-- 77875|84653|'61eaa3be-b7ce-46d3-9a36-482cc401e065'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'16'|221020|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81014|'{78545,78727,84653,77875}'|4
-- 81014|84653|'2e657ab0-4e5c-4aa4-99de-62b3624b39b5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4108'|229245|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81014|'{78545,78727,84653,81014}'|4
-- 77883|84653|'31524a8d-f5df-4a22-9697-1791caf72692'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'17'|221038|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81088|'{78545,78727,84653,77883}'|4
-- 81088|84653|'806c00f0-64b1-496b-ac23-143664ef687d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4109'|229421|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81088|'{78545,78727,84653,81088}'|4
-- 77916|84653|'68dd546f-b3b6-423b-a6b5-5f5032e4ce81'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'19'|221104|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81118|'{78545,78727,84653,77916}'|4
-- 81118|84653|'f3447545-3e2b-4084-b1c2-9333f0a34649'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4110'|229480|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81118|'{78545,78727,84653,81118}'|4
-- 81195|84653|'eea892d5-265c-4418-8c2a-7d237a93d3d8'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4111'|229659|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81320|'{78545,78727,84653,81195}'|4
-- 81320|84653|'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'1'|229978|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81320|'{78545,78727,84653,81320}'|4
-- -------------------------------------------------------------------------------------------------------------------------------------

SELECT * FROM gar_tmp_pcg_trans.f_xxx_adr_area_show_data (); -- 26502

SELECT * FROM gar_tmp_pcg_trans.f_xxx_adr_area_show_data() 
    WHERE (fias_guid IN ('d63feac3-6ae3-4d45-934c-f6b6516e20f2', '5b8bba72-59a1-4e73-b917-848e7dd36c32', 'eea892d5-265c-4418-8c2a-7d237a93d3d8', '8d58ca8c-a65a-4370-a5d4-584f44ac5b73')); -- 

SELECT * FROM gar_tmp_pcg_trans.f_xxx_adr_area_show_data() WHERE (nm_addr_obj = 'Ахульго' );
--------------------------------------------------------------------------------------------
-- 77030|78727|'addedb59-b035-4c75-860c-7a63099c6130'
-- 80151|84653|'73b4b5d5-0977-4a37-9982-04d8fb5c739d'
-- 80724|84454|'5b8bba72-59a1-4e73-b917-848e7dd36c32'
-- 81368|84564|'0dde2371-ae78-441c-a78f-46a510a484ca'

SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = 'd63feac3-6ae3-4d45-934c-f6b6516e20f2')  
     UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '5b8bba72-59a1-4e73-b917-848e7dd36c32');

-- ===================================================================================================

BEGIN;
ROLLBACK;
   SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := NULL::uuid, p_qty := 1);  -- 58
   -----------------------------------------------------------------------------------------------------------
-- 79107|84454|'d63feac3-6ae3-4d45-934c-f6b6516e20f2'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3769'|224297|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80724|'{78545,78727,84454,79107}'|4
-- 80724|84454|'5b8bba72-59a1-4e73-b917-848e7dd36c32'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'2'|228567|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80724|'{78545,78727,84454,80724}'|4
-- 80758|84454|'fffd8162-a968-4f92-9a49-d691a8424848'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'3'|228649|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80758|'{78545,78727,84454,80758}'|4
-- 79446|84454|'f81097f2-089a-4f04-9ec0-0f4a7682aa2b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Колосная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3774'|225132|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80758|'{78545,78727,84454,79446}'|4
-- 79527|84454|'c6cb27a2-32ab-4165-be89-bf03cdc9d461'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3775'|225349|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80792|'{78545,78727,84454,79527}'|4
-- 80792|84454|'354baa65-215d-4df5-aec0-1b6dbfada0c9'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Пшеничная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'4'|228731|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80792|'{78545,78727,84454,80792}'|4
-- 81169|84454|'89e7b4b0-aa0c-4977-b631-79709c13a773'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'33'|'0'|'14'|229595|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|81169|'{78545,78727,84454,81169}'|4
-- 79745|84454|'9e1bf45e-3edc-4766-ab42-daa5e908e55b'|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'Шиназская'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3768'|'3778'|226000|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81169|'{78545,78727,84454,79745}'|4
-- 82346|84564|'4399ca45-009d-41c2-b968-0f0065cd793c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Алисултанова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4724'|232456|0|10|'Добавление'|'2019-09-25'|'2079-06-06'|82694|'{78545,78727,84564,82346}'|4
-- 82694|84564|'0da140b2-b46d-4ef1-9174-574377b1e86b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Алисултанова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'13'|233270|0|10|'Добавление'|'2019-10-29'|'2079-06-06'|82694|'{78545,78727,84564,82694}'|4
-- 79353|84564|'75149768-0ba3-4f81-8e3f-46a227a41154'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3994'|224864|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81368|'{78545,78727,84564,79353}'|4
-- 81368|84564|'0dde2371-ae78-441c-a78f-46a510a484ca'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'1'|230086|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|81368|'{78545,78727,84564,81368}'|4
-- 81431|84564|'e31d0897-8a46-48d3-a213-7ae993c50de9'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'2'|230228|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81431|'{78545,78727,84564,81431}'|4
-- 79405|84564|'5cd754b0-2358-4afb-94da-136a378c0f0b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3995'|225010|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81431|'{78545,78727,84564,79405}'|4
-- 81458|84564|'7248f5e2-99b1-47e2-a5e4-190ea89df774'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ломаная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'3'|230344|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81458|'{78545,78727,84564,81458}'|4
-- 79493|84564|'e02001a5-132f-43da-a8f5-99a4464a9713'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Ломаная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3996'|225256|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81458|'{78545,78727,84564,79493}'|4
-- 79541|84564|'ba5e3530-83f7-4896-b828-048f6342263a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3997'|225401|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81502|'{78545,78727,84564,79541}'|4
-- 81502|84564|'e8031e05-0550-4045-a587-cd5d9d41478d'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'4'|230414|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81502|'{78545,78727,84564,81502}'|4
-- 81531|84564|'bd7e3cec-c71c-4b96-8b67-7eec2651a8b8'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'5'|230484|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81531|'{78545,78727,84564,81531}'|4
-- 79628|84564|'8fc12041-e9ba-4e26-9017-b327128d6404'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'3998'|225667|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81531|'{78545,78727,84564,79628}'|4
-- 79737|84564|'015bc036-5adc-44ba-953f-c98944ebdf3c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4000'|225942|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81643|'{78545,78727,84564,79737}'|4
-- 81643|84564|'c692373c-54e8-4f06-93a9-979b9b9c6f7c'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'7'|230777|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81643|'{78545,78727,84564,81643}'|4
-- 79832|84564|'914e49d9-5ec0-48c3-93f3-2965ac004be3'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4001'|226217|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80221|'{78545,78727,84564,79832}'|4
-- 80221|84564|'bf24881d-00cb-460d-9ad5-b1359fac1b42'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'12'|227269|0|10|'Добавление'|'2017-08-14'|'2079-06-06'|80221|'{78545,78727,84564,80221}'|4
-- 81714|84564|'369aee13-6904-43a2-b3ab-15365e1655d1'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'9'|230940|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81714|'{78545,78727,84564,81714}'|4
-- 79948|84564|'2c0b4d68-c423-4da5-a3d1-7be1912ed5b1'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4003'|226569|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81714|'{78545,78727,84564,79948}'|4
-- 81776|84564|'64198789-a489-45d9-a15b-111f58d9009a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Финиковая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'10'|231074|0|10|'Добавление'|'2013-07-09'|'2079-06-06'|81776|'{78545,78727,84564,81776}'|4
-- 80011|84564|'802c73f6-749a-4ced-9c7e-9baf5017855b'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Финиковая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4004'|226724|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81776|'{78545,78727,84564,80011}'|4
-- 80071|84564|'9724eb65-9e0f-4672-a9c1-fe7416aef368'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'3993'|'4005'|226885|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81795|'{78545,78727,84564,80071}'|4
-- 81795|84564|'2afcbebe-4123-4cf9-ab08-c98e134ef39a'|'8b8064d2-0262-4842-beca-0dc01360bd05'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'32'|'0'|'11'|231135|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81795|'{78545,78727,84564,81795}'|4
-- 82827|84653|'b24a138d-ee8f-42fb-b05a-28ff84f937a2'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'3'|233588|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87211|'{78545,78727,84653,82827}'|4
-- 87211|84653|'c105f543-3ed9-4ea7-a1c0-6e235f035539'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'2-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4113'|244384|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87211|'{78545,78727,84653,87211}'|4
-- 77368|84653|'0cea9d82-4384-46d3-9a22-6d857a14f107'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'4'|219712|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87289|'{78545,78727,84653,77368}'|4
-- 87289|84653|'0a33dc66-3cdc-469e-9f6e-2ddf1c42a33e'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'3-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4114'|244555|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87289|'{78545,78727,84653,87289}'|4
-- 87375|84653|'45c00a79-a081-4c88-87dd-cecbc513525d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4115'|244737|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|87375|'{78545,78727,84653,87375}'|4
-- 77415|84653|'5296e770-88ab-40da-8df7-d5c1ae8f1f08'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'4-й Локомотивной 2-й'|203|'туп'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'5'|219810|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|87375|'{78545,78727,84653,77415}'|4
-- 77444|84653|'146d6237-c774-4542-9535-a8d4dd14def8'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'6'|219894|0|10|'Добавление'|'2013-05-31'|'2079-06-06'|80151|'{78545,78727,84653,77444}'|4
-- 80151|84653|'73b4b5d5-0977-4a37-9982-04d8fb5c739d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Ахульго'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4094'|227090|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80151|'{78545,78727,84653,80151}'|4
-- 80209|84653|'502ff6ed-6854-4b57-a293-3ff7f0be4b3b'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4095'|227241|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80209|'{78545,78727,84653,80209}'|4
-- 77511|84653|'049bd9f9-ebfa-4e6f-a07b-edb7f43994c6'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Благородная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'7'|220052|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80209|'{78545,78727,84653,77511}'|4
-- 80243|84653|'3fbb86d4-c4f1-449f-9c9a-66e277f829d5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4096'|227336|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80243|'{78545,78727,84653,80243}'|4
-- 77530|84653|'e874d77b-eaae-4dd1-aae7-9e7a5de350ac'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Даганова'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'8'|220103|0|10|'Добавление'|'2014-11-20'|'2079-06-06'|80243|'{78545,78727,84653,77530}'|4
-- 77587|84653|'c65e14e4-9a94-4a64-8d71-406418463ce3'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'9'|220309|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80293|'{78545,78727,84653,77587}'|4
-- 80293|84653|'019d88e6-afae-4f11-bec7-9a9fc3e663a5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Конечная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4097'|227476|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80293|'{78545,78727,84653,80293}'|4
-- 80798|84653|'90aab9fa-8bad-4f0c-9859-7a0a0d181791'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4105'|228752|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80798|'{78545,78727,84653,80798}'|4
-- 77742|84653|'012d0b3f-b23f-46ee-86ca-348dfd33ada3'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Межрайонная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'13'|220729|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80798|'{78545,78727,84653,77742}'|4
-- 80848|84653|'a04a5c83-fcde-4653-9795-8bb8dfe2b8c6'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4106'|228892|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80848|'{78545,78727,84653,80848}'|4
-- 77785|84653|'a2a088e3-f36f-4c07-b05b-b8b437f99253'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мира'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'14'|220791|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|80848|'{78545,78727,84653,77785}'|4
-- 80933|84653|'1b708347-9315-45e5-b0f7-44d0f4f5fcb7'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4107'|229081|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|80933|'{78545,78727,84653,80933}'|4
-- 77839|84653|'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Мостовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'15'|220949|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|80933|'{78545,78727,84653,77839}'|4
-- 77875|84653|'61eaa3be-b7ce-46d3-9a36-482cc401e065'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'16'|221020|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81014|'{78545,78727,84653,77875}'|4
-- 81014|84653|'2e657ab0-4e5c-4aa4-99de-62b3624b39b5'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Рейсовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4108'|229245|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81014|'{78545,78727,84653,81014}'|4
-- 77883|84653|'31524a8d-f5df-4a22-9697-1791caf72692'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'17'|221038|0|10|'Добавление'|'2013-04-09'|'2079-06-06'|81088|'{78545,78727,84653,77883}'|4
-- 81088|84653|'806c00f0-64b1-496b-ac23-143664ef687d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4109'|229421|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81088|'{78545,78727,84653,81088}'|4
-- 77916|84653|'68dd546f-b3b6-423b-a6b5-5f5032e4ce81'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'19'|221104|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81118|'{78545,78727,84653,77916}'|4
-- 81118|84653|'f3447545-3e2b-4084-b1c2-9333f0a34649'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Транзитная'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4110'|229480|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81118|'{78545,78727,84653,81118}'|4
-- 81195|84653|'eea892d5-265c-4418-8c2a-7d237a93d3d8'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'0'|'4093'|'4111'|229659|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|81320|'{78545,78727,84653,81195}'|4
-- 81320|84653|'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Фруктовая'|204|'ул'|8|'Элемент улично-дорожной сети'|'5'|'0'|'1'|'31'|'0'|'1'|229978|0|10|'Добавление'|'2013-07-24'|'2079-06-06'|81320|'{78545,78727,84653,81320}'|4


 SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_set_data" ( 
       p_fias_guid  := NULL::uuid     
      ,p_qty        := 1
      ,p_descr      := 'ТЕСТ. Дагестан'   
);       -- 58

SELECT * FROM gar_fias_pcg_load."_NEW_f_addr_obj_update_children" ()  ORDER BY 3;
-------------------------------------------------------------------------------------------------------------
-- 'c105f543-3ed9-4ea7-a1c0-6e235f035539'|'b24a138d-ee8f-42fb-b05a-28ff84f937a2'|'2-Й ЛОКОМОТИВНОЙ 2-Й'|203|12|8
-- '0a33dc66-3cdc-469e-9f6e-2ddf1c42a33e'|'0cea9d82-4384-46d3-9a22-6d857a14f107'|'3-Й ЛОКОМОТИВНОЙ 2-Й'|203|13|8
-- '45c00a79-a081-4c88-87dd-cecbc513525d'|'5296e770-88ab-40da-8df7-d5c1ae8f1f08'|'4-Й ЛОКОМОТИВНОЙ 2-Й'|203|11|8
-- '0da140b2-b46d-4ef1-9174-574377b1e86b'|'4399ca45-009d-41c2-b968-0f0065cd793c'|'АЛИСУЛТАНОВА'|204|0|8
-- '0dde2371-ae78-441c-a78f-46a510a484ca'|'75149768-0ba3-4f81-8e3f-46a227a41154'|'АХУЛЬГО'|204|5|8
-- '73b4b5d5-0977-4a37-9982-04d8fb5c739d'|'146d6237-c774-4542-9535-a8d4dd14def8'|'АХУЛЬГО'|204|1|8
-- '5b8bba72-59a1-4e73-b917-848e7dd36c32'|'d63feac3-6ae3-4d45-934c-f6b6516e20f2'|'АХУЛЬГО'|204|251|8
-- '502ff6ed-6854-4b57-a293-3ff7f0be4b3b'|'049bd9f9-ebfa-4e6f-a07b-edb7f43994c6'|'БЛАГОРОДНАЯ'|204|75|8
-- 'e31d0897-8a46-48d3-a213-7ae993c50de9'|'5cd754b0-2358-4afb-94da-136a378c0f0b'|'БЛАГОРОДНАЯ'|204|2|8
-- '3fbb86d4-c4f1-449f-9c9a-66e277f829d5'|'e874d77b-eaae-4dd1-aae7-9e7a5de350ac'|'ДАГАНОВА'|204|1|8
-- 'fffd8162-a968-4f92-9a49-d691a8424848'|'f81097f2-089a-4f04-9ec0-0f4a7682aa2b'|'КОЛОСНАЯ'|204|18|8
-- '019d88e6-afae-4f11-bec7-9a9fc3e663a5'|'c65e14e4-9a94-4a64-8d71-406418463ce3'|'КОНЕЧНАЯ'|204|0|8
-- 'aece773e-5c5a-4dbe-8455-aa542f548704'|'6a5b8826-dc74-4694-bbba-776daa464be1'|'ЛОКОМОТИВ'|79|0|6
-- '7248f5e2-99b1-47e2-a5e4-190ea89df774'|'e02001a5-132f-43da-a8f5-99a4464a9713'|'ЛОМАНАЯ'|204|45|8
-- '90aab9fa-8bad-4f0c-9859-7a0a0d181791'|'012d0b3f-b23f-46ee-86ca-348dfd33ada3'|'МЕЖРАЙОННАЯ'|204|0|8
-- 'e8031e05-0550-4045-a587-cd5d9d41478d'|'ba5e3530-83f7-4896-b828-048f6342263a'|'МЕЖРАЙОННАЯ'|204|2|8
-- 'bd7e3cec-c71c-4b96-8b67-7eec2651a8b8'|'8fc12041-e9ba-4e26-9017-b327128d6404'|'МИРА'|204|110|8
-- 'a04a5c83-fcde-4653-9795-8bb8dfe2b8c6'|'a2a088e3-f36f-4c07-b05b-b8b437f99253'|'МИРА'|204|106|8
-- '1b708347-9315-45e5-b0f7-44d0f4f5fcb7'|'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'|'МОСТОВАЯ'|204|39|8
-- 'c692373c-54e8-4f06-93a9-979b9b9c6f7c'|'015bc036-5adc-44ba-953f-c98944ebdf3c'|'МОСТОВАЯ'|204|0|8
-- 'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'|'629a5247-b5e9-4abe-b420-ea7373a15cdc'|'НЕФТЕКАЧКА'|79|0|6
-- '0b89184c-17b8-4d17-87e9-063329bc2e5b'|'fe6f98aa-5009-434b-ac1d-2b25a6447d0b'|'ПИНХАСКАЛА'|199|0|8
-- '354baa65-215d-4df5-aec0-1b6dbfada0c9'|'c6cb27a2-32ab-4165-be89-bf03cdc9d461'|'ПШЕНИЧНАЯ'|204|104|8
-- '2e657ab0-4e5c-4aa4-99de-62b3624b39b5'|'61eaa3be-b7ce-46d3-9a36-482cc401e065'|'РЕЙСОВАЯ'|204|40|8
-- '806c00f0-64b1-496b-ac23-143664ef687d'|'31524a8d-f5df-4a22-9697-1791caf72692'|'САДОВАЯ'|204|40|8
-- 'bf24881d-00cb-460d-9ad5-b1359fac1b42'|'914e49d9-5ec0-48c3-93f3-2965ac004be3'|'САДОВАЯ'|204|11|8
-- '8b8064d2-0262-4842-beca-0dc01360bd05'|'0f617717-1040-4742-bfb2-0eaaa040d4fa'|'САДОВОД'|79|0|6
-- 'f3447545-3e2b-4084-b1c2-9333f0a34649'|'68dd546f-b3b6-423b-a6b5-5f5032e4ce81'|'ТРАНЗИТНАЯ'|204|66|8
-- '369aee13-6904-43a2-b3ab-15365e1655d1'|'2c0b4d68-c423-4da5-a3d1-7be1912ed5b1'|'ТРАНЗИТНАЯ'|204|5|8
-- '450279b7-39ac-4e99-a505-10dd7b675d3d'|'0e4ebdbe-e302-4237-94db-0c168f22b5db'|'УРОЖАЙ'|79|0|6
-- '64198789-a489-45d9-a15b-111f58d9009a'|'802c73f6-749a-4ced-9c7e-9baf5017855b'|'ФИНИКОВАЯ'|204|106|8
-- '2afcbebe-4123-4cf9-ab08-c98e134ef39a'|'9724eb65-9e0f-4672-a9c1-fe7416aef368'|'ФРУКТОВАЯ'|204|53|8
-- '8d58ca8c-a65a-4370-a5d4-584f44ac5b73'|'eea892d5-265c-4418-8c2a-7d237a93d3d8'|'ФРУКТОВАЯ'|204|46|8
-- '89e7b4b0-aa0c-4977-b631-79709c13a773'|'9e1bf45e-3edc-4766-ab42-daa5e908e55b'|'ШИНАЗСКАЯ'|204|63|8

SELECT * FROM gar_fias.twin_addr_objects;
COMMIT;
EXPLAIN analYze
SELECT * FROM gar_fias.twin_addr_objects WHERE (fias_guid_new = '5b8bba72-59a1-4e73-b917-848e7dd36c32');

EXPLAIN analYze
SELECT * FROM gar_fias.twin_addr_objects WHERE (fias_guid_new = 'd63feac3-6ae3-4d45-934c-f6b6516e20f2');