SELECT * FROM gar_tmp.adr_area_type;
-----------------------------------------------------------
-- 1|'Аал'|'аал'|0|''
-- 2|'Автономный округ'|'АО'|0|''
-- 3|'Автономная область'|'Аобл'|0|''
-- 4|'Арбан'|'арбан'|0|''
-- 5|'Аул'|'аул'|0|''
-- 6|'Выселки(ок)'|'высел.'|0|''
-- 7|'Город'|'г.'|0|''
-- 8|'Городок'|'городок'|0|''
-- 9|'городской поселок'|'гп'|0|''
-- 10|'Деревня'|'д.'|0|''
-- 11|'Дачный поселок'|'дп'|0|''
-- 12|'Железнодорожная будка'|'ж/д_будка'|0|''
-- 13|'Железнодорожная казарма'|'ж/д_казарм'|0|''
-- 14|'ж/д останов. (обгонный) пункт'|'ж/д_оп'|0|''
-- 15|'Железнодорожная платформа'|'ж/д_платф'|0|''
-- 16|'Железнодорожный пост'|'ж/д_пост'|0|''
-- 17|'Железнодорожный разъезд'|'ж/д_рзд'|0|''
-- 18|'Железнодорожная станция'|'ж/д_ст'|0|''
-- 19|'Жилая зона'|'жилзона'|0|''
-- 20|'Жилой район'|'жилрайон'|0|''
-- 21|'Заимка'|'заимка'|0|''
-- 22|'Казарма'|'казарма'|0|''
-- 23|'Квартал'|'кв-л'|0|''
-- 24|'Кордон'|'кордон'|0|''
-- 25|'Курортный поселок'|'кп'|0|''
-- 26|'Край'|'край'|0|''
-- 27|'Леспромхоз'|'лпх'|0|''
-- 28|'Местечко'|'м.'|0|''
-- 29|'Массив'|'массив'|0|''
-- 30|'Микрорайон'|'мкр.'|0|''
-- 31|'Населенный пункт'|'нп'|0|''
-- 32|'Область'|'обл.'|0|''
-- 33|'Остров'|'остров'|0|''
-- 34|'Поселок'|'п.'|0|''
-- 35|'Поселение'|'поселение'|0|''
-- 36|'Поселок и(при) станция(и)'|'п/ст'|0|''
-- 37|'Поселок городского типа'|'пгт'|0|''
-- 38|'Починок'|'починок'|0|''
-- 39|'Промышленная зона'|'промзона'|0|''
-- 40|'Район'|'р-н'|0|''
-- 41|'Республика'|'Респ'|0|''
-- 42|'Разъезд'|'рзд'|0|''
-- 43|'Рабочий поселок'|'рп'|0|''
-- 44|'Село'|'с'|0|''
-- 45|'Сельская администрация'|'с/а'|0|''
-- 46|'Сельское муницип.образование'|'с/мо'|0|''
-- 47|'Сельский округ'|'с/о'|0|''
-- 48|'Сельское поселение'|'с/п'|0|''
-- 49|'Сельсовет'|'с/с'|0|''
-- 50|'Слобода'|'сл'|0|''
-- 51|'Садовое неком-е товарищество'|'снт'|0|''
-- 52|'Станция'|'ст'|0|''
-- 53|'Станица'|'ст-ца'|0|''
-- 54|'Территория'|'тер'|0|''
-- 55|'Улус'|'у'|0|''
-- 56|'Хутор'|'х'|0|''
-- 57|'Дачное неком-е партнерство'|'днп'|0|''
-- 58|'Территория ДНП'|'тер. ДНП'|0|''
-- 59|'Территория ДНТ'|'тер. ДНТ'|0|''
-- 60|'Территория СНТ'|'тер. СНТ'|0|''
-- 61|'Территория ТСН'|'тер. ТСН'|0|''
-- 62|'Город федерального значения'|'г.ф.з.'|0|''
-- 63|'Округ'|'округ'|0|''
-- 64|'Чувашия'|'Чувашия'|0|''
-- 65|'Внутригородская территория'|'вн.тер. г.'|0|''
-- 66|'Городской округ'|'г.о.'|0|''
-- 67|'Муниципальный район'|'м.р-н'|0|''
-- 68|'Волость'|'волость'|0|''
-- 69|'Почтовое отделение'|'п/о'|0|''
-- 70|'Автодорога'|'автодорога'|0|''
-- 71|'Железнодорожный блокпост'|'ж/д бл-ст'|0|''
-- 72|'Железнодорожная ветка'|'ж/д в-ка'|0|''
-- 73|'Железнодорожный комбинат'|'ж/д к-т'|0|''
-- 74|'Железнодорожный остановочный пункт'|'ж/д о.п.'|0|''
-- 75|'Железнодорожный путевой пост'|'ж/д п.п.'|0|''
-- 76|'Железнодорожная площадка'|'ж/д пл-ка'|0|''
-- 77|'Зимовье'|'зим.'|0|''
-- 78|'Кишлак'|'киш.'|0|''
-- 79|'Поселок при железнодорожной станции'|'п. ж/д ст.'|0|''
-- 80|'Планировочный район'|'пл.р-н'|0|''
-- 81|'Погост'|'погост'|0|''
-- 82|'Поселок разъезда'|'пос.рзд'|0|''
-- 83|'Сельский поселок'|'сп'|0|''
-- 84|'Абонентский ящик'|'а/я'|0|''
-- 85|'Аллея'|'ал.'|0|''
-- 86|'Берег'|'б-г'|0|''
-- 87|'Бульвар'|'б-р'|0|''
-- 88|'Вал'|'вал'|0|''
-- 89|'Въезд'|'взд.'|0|''
-- 90|'Гаражно-строительный кооп.'|'гск'|0|''
-- 91|'Дорога'|'дор.'|0|''
-- 92|'Заезд'|'ззд.'|0|''
-- 93|'Зона (массив)'|'зона'|0|''
-- 94|'Километр'|'км'|0|''
-- 95|'Коса'|'коса'|0|''
-- 96|'Кольцо'|'к-цо'|0|''
-- 97|'Линия'|'лн.'|0|''
-- 98|'Местность'|'местность'|0|''
-- 99|'Месторождение'|'месторожд.'|0|''
-- 100|'Некоммерческое партнерство'|'н/п'|0|''
-- 101|'Набережная'|'наб.'|0|''
-- 102|'Промышленный район'|'п/р'|0|''
-- 103|'Парк'|'парк'|0|''
-- 104|'Переезд'|'пер-д'|0|''
-- 105|'Платформа'|'платф.'|0|''
-- 106|'Площадка'|'пл-ка'|0|''
-- 107|'Порт'|'порт'|0|''
-- 108|'Просек'|'пр-к'|0|''
-- 109|'Просека'|'пр-ка'|0|''
-- 110|'Проспект'|'пр-кт'|0|''
-- 111|'Проселок'|'пр-лок'|0|''
-- 112|'Проулок'|'проул.'|0|''
-- 113|'Сад'|'сад'|0|''
-- 114|'Спуск'|'с-к'|0|''
-- 115|'Сквер'|'сквер'|0|''
-- 116|'Территория ГСК'|'тер. ГСК'|0|''
-- 117|'Территория ДНО'|'тер. ДНО'|0|''
-- 118|'Территория ДПК'|'тер. ДПК'|0|''
-- 119|'Территория ОНО'|'тер. ОНО'|0|''
-- 120|'Территория ОНП'|'тер. ОНП'|0|''
-- 121|'Территория ОНТ'|'тер. ОНТ'|0|''
-- 122|'Территория ОПК'|'тер. ОПК'|0|''
-- 123|'Территория ПК'|'тер. ПК'|0|''
-- 124|'Территория СНО'|'тер. СНО'|0|''
-- 125|'Территория СНП'|'тер. СНП'|0|''
-- 126|'Территория СПК'|'тер. СПК'|0|''
-- 127|'Территория ТСЖ'|'тер. ТСЖ'|0|''
-- 128|'Территория СОСН'|'тер.СОСН'|0|''
-- 129|'Территория ФХ'|'тер.ф.х.'|0|''
-- 130|'Тракт'|'тракт'|0|''
-- 131|'Тупик'|'туп.'|0|''
-- 132|'Усадьба'|'ус.'|0|''
-- 133|'Фермерское хозяйство'|'ф/х'|0|''
-- 134|'Шоссе'|'ш.'|0|''
-- 135|'Юрты'|'ю.'|0|''
-- 136|'городское поселение'|'г.п.'|0|''
-- 137|'внутригородской район'|'вн.р-н'|0|''
-- 138|'межселенная территория'|'межсел.тер'|0|''
-- 139|'Муниципальный округ'|'м.о.'|0|''
-- 140|'Поселок при станции (поселок станции)'|'п. ст.'|0|''
-- 141|'Садовое товарищество'|'с/т'|0|''
-- 142|'Выселки'|'в-ки'|0|''

SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', 'd16a1b87-8a78-4c05-aec9-53087f7074e3'::uuid);
SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', 'bf14786f-6c0e-4369-8907-57f9d3fd93ac'::uuid);
SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '6b2fa809-1eac-419a-b744-a12a97e4a635'::uuid);
SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', 91406); -- нет
SELECT * FROM GAR_TMP.XXX_ADR_AREA WHERE (id_addr_obj = 91406);
---------------------------------------------------------------------------------------------------------
SELECT * FROM gar_tmp.xxx_adr_street_type WHERE (113 = ANY(fias_ids));
SELECT * FROM gar_tmp.xxx_adr_street_type WHERE (158 = ANY(fias_ids));
-----------------------------------------------------------------------
SELECT * FROM gar_tmp.xxx_adr_area_type WHERE (113 = ANY(fias_ids));
SELECT * FROM gar_tmp.xxx_adr_area_type WHERE (158 = ANY(fias_ids));
--------------------------------------------------------------------
-- '{46,241}'|1|'Аал'|'Аал'|'аал'|'аал'|0|'аал'|f
-- '{40}'|47|'Сельский округ'|'Сельский округ'|'с/о'|'с/о'|0|'сельскийокруг'|f
-- '{3,4,17}'|2|'Автономный округ'|'Автономный округ'|'а.окр.'|'АО'|0|'автономныйокруг'|f
-- '{2,5}'|3|'Автономная область'|'Автономная область'|'а.обл.'|'Аобл'|0|'автономнаяобласть'|f
-- '{48,243}'|4|'Арбан'|'Арбан'|'арбан'|'арбан'|0|'арбан'|f
-- '{49,244}'|5|'Аул'|'Аул'|'аул'|'аул'|0|'аул'|f
-- '{51}'|6|'Выселки(ок)'|'Выселки(ок)'|'высел'|'высел.'|0|'выселкиок'|f
-- '{6,7,28,29,52,423,429}'|7|'Город'|'Город'|'г'|'г.'|0|'город'|f
-- '{53,249}'|8|'Городок'|'Городок'|'г-к'|'городок'|0|'городок'|f
-- '{54,433}'|9|'Городской поселок'|'городской поселок'|'гп'|'гп'|0|'городскойпоселок'|f
-- '{55,251,434}'|10|'Деревня'|'Деревня'|'д'|'д.'|0|'деревня'|f
-- '{30,56,57}'|11|'Дачный поселок'|'Дачный поселок'|'дп'|'дп'|0|'дачныйпоселок'|f
-- '{58,67,254}'|12|'Железнодорожная будка'|'Железнодорожная будка'|'ж/д б-ка'|'ж/д_будка'|0|'железнодорожнаябудка'|f
-- '{61,68,255}'|13|'Железнодорожная казарма'|'Железнодорожная казарма'|'ж/д к-ма'|'ж/д_казарм'|0|'железнодорожнаяказарма'|f
-- '{69}'|14|'ж/д останов. (обгонный) пункт'|'ж/д останов. (обгонный) пункт'|'ж/д_оп'|'ж/д_оп'|0|'ждостановобгонныйпункт'|f
-- '{66,70,256}'|15|'Железнодорожная платформа'|'Железнодорожная платформа'|'ж/д пл-ма'|'ж/д_платф'|0|'железнодорожнаяплатформа'|f
-- '{71}'|16|'Железнодорожный пост'|'Железнодорожный пост'|'ж/д_пост'|'ж/д_пост'|0|'железнодорожныйпост'|f
-- '{72,257,436}'|17|'Железнодорожный разъезд'|'Железнодорожный разъезд'|'ж/д_рзд'|'ж/д_рзд'|0|'железнодорожныйразъезд'|f
-- '{73,258,435}'|18|'Железнодорожная станция'|'Железнодорожная станция'|'ж/д_ст'|'ж/д_ст'|0|'железнодорожнаястанция'|f
-- '{74}'|19|'Жилая зона'|'Жилая зона'|'жилзона'|'жилзона'|0|'жилаязона'|f
-- '{75,259}'|20|'Жилой район'|'Жилой район'|'жилрайон'|'жилрайон'|0|'жилойрайон'|f
-- '{76,437}'|21|'Заимка'|'Заимка'|'заимка'|'заимка'|0|'заимка'|f
-- '{78}'|22|'Казарма'|'Казарма'|'казарма'|'казарма'|0|'казарма'|f
-- '{79,262}'|23|'Квартал'|'Квартал'|'кв-л'|'кв-л'|0|'квартал'|f
-- '{81}'|24|'Кордон'|'Кордон'|'кордон'|'кордон'|0|'кордон'|f
-- '{31,82,438}'|25|'Курортный поселок'|'Курортный поселок'|'кп'|'кп'|0|'курортныйпоселок'|f
-- '{9}'|26|'Край'|'Край'|'край'|'край'|0|'край'|f
-- '{83}'|27|'Леспромхоз'|'Леспромхоз'|'лпх'|'лпх'|0|'леспромхоз'|f
-- '{84,269,439}'|28|'Местечко'|'Местечко'|'м'|'м.'|0|'местечко'|f
-- '{32,85}'|29|'Массив'|'Массив'|'массив'|'массив'|0|'массив'|f
-- '{86,270,271}'|30|'Микрорайон'|'Микрорайон'|'мкр'|'мкр.'|0|'микрорайон'|f
-- '{87,88}'|31|'Населенный пункт'|'Населенный пункт'|'нп'|'нп'|0|'населенныйпункт'|f
-- '{10,11}'|32|'Область'|'Область'|'обл'|'обл.'|0|'область'|f
-- '{89,275}'|33|'Остров'|'Остров'|'остров'|'остров'|0|'остров'|f
-- '{33,90,276,440}'|34|'Поселок'|'Поселок'|'п'|'п.'|0|'поселок'|f
-- '{21,22}'|35|'Поселение'|'Поселение'|'п'|'поселение'|0|'поселение'|f
-- '{35,36,95,96}'|37|'Поселок городского типа'|'Поселок городского типа'|'пгт'|'пгт'|0|'поселокгородскоготипа'|f
-- '{99,281,442}'|38|'Починок'|'Починок'|'починок'|'починок'|0|'починок'|f
-- '{100,291}'|39|'Промышленная зона'|'Промышленная зона'|'промзона'|'промзона'|0|'промышленнаязона'|f
-- '{13,14}'|41|'Республика'|'Республика'|'Респ'|'Респ'|0|'республика'|f
-- '{101,293,444}'|42|'Разъезд'|'Разъезд'|'рзд'|'рзд'|0|'разъезд'|f
-- '{37,102,430,443}'|43|'Рабочий поселок'|'Рабочий поселок'|'рп'|'рп'|0|'рабочийпоселок'|f
-- '{103,295,426,431,445}'|44|'Село'|'Село'|'с'|'с'|0|'село'|f
-- '{94}'|36|'Поселок и(при) станция(и)'|'Поселок и(при) станция(и)'|'п/ст'|'п/ст'|0|'поселокипристанцияи'|f
-- '{38}'|45|'Сельская администрация'|'Сельская администрация'|'с/а'|'с/а'|0|'сельскаяадминистрация'|f
-- '{261}'|93|'Зона (массив)'|'Зона (массив)'|'зона'|'зона'|0|'зонамассив'|f
-- '{263}'|94|'Километр'|'Километр'|'км'|'км'|0|'километр'|f
-- '{39}'|46|'Сельское муницип.образование'|'Сельское муницип.образование'|'с/мо'|'с/мо'|0|'сельскоемуниципобразование'|f
-- '{418,41}'|48|'сельское поселение'|'Сельское поселение'|'с.п.'|'с/п'|0|'сельскоепоселение'|f
-- '{42}'|49|'Сельсовет'|'Сельсовет'|'с/с'|'с/с'|0|'сельсовет'|f
-- '{104,299,446}'|50|'Слобода'|'Слобода'|'сл'|'сл'|0|'слобода'|f
-- '{108,302,447}'|52|'Станция'|'Станция'|'ст'|'ст'|0|'станция'|f
-- '{109}'|53|'Станица'|'Станица'|'ст-ца'|'ст-ца'|0|'станица'|f
-- '{24,43,110,304,305}'|54|'Территория'|'Территория'|'тер'|'тер'|0|'территория'|f
-- '{25,26,111,448}'|55|'Улус'|'Улус'|'у'|'у'|0|'улус'|f
-- '{112,329,449}'|56|'Хутор'|'Хутор'|'х'|'х'|0|'хутор'|f
-- '{252}'|57|'Дачное неком-е партнерство'|'Дачное неком-е партнерство'|'днп'|'днп'|0|'дачноенекомепартнерство'|f
-- '{308}'|58|'Территория ДНП'|'Территория ДНП'|'тер. ДНП'|'тер. ДНП'|0|'территорияднп'|f
-- '{309}'|59|'Территория ДНТ'|'Территория ДНТ'|'тер. ДНТ'|'тер. ДНТ'|0|'территорияднт'|f
-- '{318}'|60|'Территория СНТ'|'Территория СНТ'|'тер. СНТ'|'тер. СНТ'|0|'территорияснт'|f
-- '{321}'|61|'Территория ТСН'|'Территория ТСН'|'тер. ТСН'|'тер. ТСН'|0|'территориятсн'|f
-- '{8}'|62|'Город федерального значения'|'Город федерального значения'|'г.ф.з.'|'г.ф.з.'|0|'городфедеральногозначения'|f
-- '{12}'|63|'Округ'|'Округ'|'округ'|'округ'|0|'округ'|f
-- '{15}'|64|'Чувашия'|'Чувашия'|'Чувашия'|'Чувашия'|0|'чувашия'|f
-- '{18}'|65|'Внутригородская территория'|'Внутригородская территория'|'вн.тер. г.'|'вн.тер. г.'|0|'внутригородскаятерритория'|f
-- '{19,414}'|66|'Городской округ'|'Городской округ'|'г.о.'|'г.о.'|0|'городскойокруг'|f
-- '{20,416}'|67|'Муниципальный район'|'Муниципальный район'|'м.р-н'|'м.р-н'|0|'муниципальныйрайон'|f
-- '{27,50}'|68|'Волость'|'Волость'|'волость'|'волость'|0|'волость'|f
-- '{34,92}'|69|'Почтовое отделение'|'Почтовое отделение'|'п/о'|'п/о'|0|'почтовоеотделение'|f
-- '{47}'|70|'Автодорога'|'Автодорога'|'автодорога'|'автодорога'|0|'автодорога'|f
-- '{59}'|71|'Железнодорожный блокпост'|'Железнодорожный блокпост'|'ж/д бл-ст'|'ж/д бл-ст'|0|'железнодорожныйблокпост'|f
-- '{60}'|72|'Железнодорожная ветка'|'Железнодорожная ветка'|'ж/д в-ка'|'ж/д в-ка'|0|'железнодорожнаяветка'|f
-- '{62}'|73|'Железнодорожный комбинат'|'Железнодорожный комбинат'|'ж/д к-т'|'ж/д к-т'|0|'железнодорожныйкомбинат'|f
-- '{63}'|74|'Железнодорожный остановочный пункт'|'Железнодорожный остановочный пункт'|'ж/д о.п.'|'ж/д о.п.'|0|'железнодорожныйостановочныйпункт'|f
-- '{64}'|75|'Железнодорожный путевой пост'|'Железнодорожный путевой пост'|'ж/д п.п.'|'ж/д п.п.'|0|'железнодорожныйпутевойпост'|f
-- '{65}'|76|'Железнодорожная площадка'|'Железнодорожная площадка'|'ж/д пл-ка'|'ж/д пл-ка'|0|'железнодорожнаяплощадка'|f
-- '{77}'|77|'Зимовье'|'Зимовье'|'зим.'|'зим.'|0|'зимовье'|f
-- '{80}'|78|'Кишлак'|'Кишлак'|'киш.'|'киш.'|0|'кишлак'|f
-- '{91}'|79|'Поселок при железнодорожной станции'|'Поселок при железнодорожной станции'|'п. ж/д ст.'|'п. ж/д ст.'|0|'поселокприжелезнодорожнойстанции'|f
-- '{97}'|81|'Погост'|'Погост'|'погост'|'погост'|0|'погост'|f
-- '{98,441}'|82|'Поселок разъезда'|'Поселок разъезда'|'пос.рзд'|'пос.рзд'|0|'поселокразъезда'|f
-- '{106,107}'|83|'Сельский поселок'|'Сельский поселок'|'сп'|'сп'|0|'сельскийпоселок'|f
-- '{240}'|84|'Абонентский ящик'|'Абонентский ящик'|'а/я'|'а/я'|0|'абонентскийящик'|f
-- '{242}'|85|'Аллея'|'Аллея'|'ал.'|'ал.'|0|'аллея'|f
-- '{245}'|86|'Берег'|'Берег'|'б-г'|'б-г'|0|'берег'|f
-- '{246}'|87|'Бульвар'|'Бульвар'|'б-р'|'б-р'|0|'бульвар'|f
-- '{247}'|88|'Вал'|'Вал'|'вал'|'вал'|0|'вал'|f
-- '{248}'|89|'Въезд'|'Въезд'|'взд.'|'взд.'|0|'въезд'|f
-- '{93,160,381}'|80|'Планировочный район'|'Планировочный район'|'пл.р-н'|'пл.р-н'|0|'планировочныйрайон'|f
-- '{250}'|90|'Гаражно-строительный кооп.'|'Гаражно-строительный кооп.'|'гск'|'гск'|0|'гаражностроительныйкооп'|f
-- '{253}'|91|'Дорога'|'Дорога'|'дор.'|'дор.'|0|'дорога'|f
-- '{260}'|92|'Заезд'|'Заезд'|'ззд.'|'ззд.'|0|'заезд'|f
-- '{264}'|95|'Коса'|'Коса'|'коса'|'коса'|0|'коса'|f
-- '{265}'|96|'Кольцо'|'Кольцо'|'к-цо'|'к-цо'|0|'кольцо'|f
-- '{266}'|97|'Линия'|'Линия'|'лн.'|'лн.'|0|'линия'|f
-- '{267}'|98|'Местность'|'Местность'|'местность'|'местность'|0|'местность'|f
-- '{268,272}'|99|'Месторождение'|'Месторождение'|'месторожд.'|'месторожд.'|0|'месторождение'|f
-- '{273}'|100|'Некоммерческое партнерство'|'Некоммерческое партнерство'|'н/п'|'н/п'|0|'некоммерческоепартнерство'|f
-- '{274}'|101|'Набережная'|'Набережная'|'наб.'|'наб.'|0|'набережная'|f
-- '{277}'|102|'Промышленный район'|'Промышленный район'|'п/р'|'п/р'|0|'промышленныйрайон'|f
-- '{278}'|103|'Парк'|'Парк'|'парк'|'парк'|0|'парк'|f
-- '{280}'|104|'Переезд'|'Переезд'|'пер-д'|'пер-д'|0|'переезд'|f
-- '{285}'|107|'Порт'|'Порт'|'порт'|'порт'|0|'порт'|f
-- '{287}'|108|'Просек'|'Просек'|'пр-к'|'пр-к'|0|'просек'|f
-- '{288}'|109|'Просека'|'Просека'|'пр-ка'|'пр-ка'|0|'просека'|f
-- '{289}'|110|'Проспект'|'Проспект'|'пр-кт'|'пр-кт'|0|'проспект'|f
-- '{290}'|111|'Проселок'|'Проселок'|'пр-лок'|'пр-лок'|0|'проселок'|f
-- '{292}'|112|'Проулок'|'Проулок'|'проул.'|'проул.'|0|'проулок'|f
-- '{296}'|113|'Сад'|'Сад'|'сад'|'сад'|0|'сад'|f
-- '{297}'|114|'Спуск'|'Спуск'|'с-к'|'с-к'|0|'спуск'|f
-- '{298,301}'|115|'Сквер'|'Сквер'|'сквер'|'сквер'|0|'сквер'|f
-- '{306}'|116|'Территория ГСК'|'Территория ГСК'|'тер. ГСК'|'тер. ГСК'|0|'территориягск'|f
-- '{307}'|117|'Территория ДНО'|'Территория ДНО'|'тер. ДНО'|'тер. ДНО'|0|'территориядно'|f
-- '{310}'|118|'Территория ДПК'|'Территория ДПК'|'тер. ДПК'|'тер. ДПК'|0|'территориядпк'|f
-- '{311}'|119|'Территория ОНО'|'Территория ОНО'|'тер. ОНО'|'тер. ОНО'|0|'территорияоно'|f
-- '{312}'|120|'Территория ОНП'|'Территория ОНП'|'тер. ОНП'|'тер. ОНП'|0|'территорияонп'|f
-- '{313}'|121|'Территория ОНТ'|'Территория ОНТ'|'тер. ОНТ'|'тер. ОНТ'|0|'территорияонт'|f
-- '{314}'|122|'Территория ОПК'|'Территория ОПК'|'тер. ОПК'|'тер. ОПК'|0|'территорияопк'|f
-- '{315}'|123|'Территория ПК'|'Территория ПК'|'тер. ПК'|'тер. ПК'|0|'территорияпк'|f
-- '{316}'|124|'Территория СНО'|'Территория СНО'|'тер. СНО'|'тер. СНО'|0|'территориясно'|f
-- '{317}'|125|'Территория СНП'|'Территория СНП'|'тер. СНП'|'тер. СНП'|0|'территорияснп'|f
-- '{319}'|126|'Территория СПК'|'Территория СПК'|'тер. СПК'|'тер. СПК'|0|'территорияспк'|f
-- '{320}'|127|'Территория ТСЖ'|'Территория ТСЖ'|'тер. ТСЖ'|'тер. ТСЖ'|0|'территориятсж'|f
-- '{322}'|128|'Территория СОСН'|'Территория СОСН'|'тер.СОСН'|'тер.СОСН'|0|'территориясосн'|f
-- '{323}'|129|'Территория ФХ'|'Территория ФХ'|'тер.ф.х.'|'тер.ф.х.'|0|'территорияфх'|f
-- '{324}'|130|'Тракт'|'Тракт'|'тракт'|'тракт'|0|'тракт'|f
-- '{325}'|131|'Тупик'|'Тупик'|'туп.'|'туп.'|0|'тупик'|f
-- '{327}'|132|'Усадьба'|'Усадьба'|'ус.'|'ус.'|0|'усадьба'|f
-- '{328}'|133|'Фермерское хозяйство'|'Фермерское хозяйство'|'ф/х'|'ф/х'|0|'фермерскоехозяйство'|f
-- '{330}'|134|'Шоссе'|'Шоссе'|'ш.'|'ш.'|0|'шоссе'|f
-- '{331}'|135|'Юрты'|'Юрты'|'ю.'|'ю.'|0|'юрты'|f
-- '{419}'|136|'городское поселение'|'городское поселение'|'г.п.'|'г.п.'|0|'городскоепоселение'|f
-- '{420}'|137|'внутригородской район'|'внутригородской район'|'вн.р-н'|'вн.р-н'|0|'внутригородскойрайон'|f
-- '{421}'|138|'межселенная территория'|'межселенная территория'|'межсел.тер.'|'межсел.тер'|0|'межселеннаятерритория'|f
-- '{422}'|139|'Муниципальный округ'|'Муниципальный округ'|'м.о.'|'м.о.'|0|'муниципальныйокруг'|f
-- '{283,168,387}'|105|'Платформа'|'Платформа'|'платф.'|'платф.'|0|'платформа'|f
-- '{284,169,388}'|106|'Площадка'|'Площадка'|'пл-ка'|'пл-ка'|0|'площадка'|f
-- '{425}'|140|'Поселок при станции (поселок станции)'|'Поселок при станции (поселок станции)'|'п. ст.'|'п. ст.'|0|'поселокпристанциипоселокстанции'|f
-- '{428}'|141|'Садовое товарищество'|'Садовое товарищество'|'с/т'|'с/т'|0|'садовоетоварищество'|f
-- '{432}'|142|'Выселки'|'Выселки'|'в-ки'|'в-ки'|0|'выселки'|f
-- '{23,294,44}'|40|'Район'|'Район'|'р-н'|'р-н'|0|'район'|f
-- '{105,340,194,300,402}'|51|'Садовое неком-е товарищество'|'Садовое неком-е товарищество'|'снт'|'снт'|0|'садовоенекометоварищество'|f
----------------------------------------------------------------------------------------------------------------------------------------
SELECT * FROM gar_tmp.xxx_adr_street_type;
SELECT * FROM gar_tmp.xxx_adr_street_type WHERE (113 = ANY(fias_ids)); -- нет
----------------------------------------------------------------------
-- '{114,115}'|1|'Аллея'|'Аллея'|'ал.'|'аллея'|'аллея'|f
-- '{118}'|2|'Бульвар'|'Бульвар'|'б-р'|'б-р'|'бульвар'|f
-- '{116}'|3|'Балка'|'Балка'|'балка'|'балка'|'балка'|f
-- ''|6|''|'Бухта'|''|'бухта'|'бухта'|f
-- '{117}'|4|'Берег'|'Берег'|'берег'|'берег'|'берег'|f
-- '{119}'|5|'Бугор'|'Бугор'|'бугор'|'бугор'|'бугор'|f
-- '{120}'|7|'Вал'|'Вал'|'вал'|'вал'|'вал'|f
-- '{122}'|8|'Въезд'|'Въезд'|'въезд'|'въезд'|'въезд'|f
-- '{136,137}'|9|'Заезд'|'Заезд'|'заезд'|'заезд'|'заезд'|f
-- '{138}'|10|'Зона'|'Зона'|'зона'|'зона'|'зона'|f
-- ''|11|''|'Канал'|''|'канал'|'канал'|f
-- '{140}'|12|'Квартал'|'Квартал'|'кв-л'|'кв-л'|'квартал'|f
-- '{142,144}'|13|'Кольцо'|'Кольцо'|'кольцо'|'кольцо'|'кольцо'|f
-- '{143}'|14|'Коса'|'Коса'|'коса'|'коса'|'коса'|f
-- '{145,146}'|15|'Линия'|'Линия'|'линия'|'линия'|'линия'|f
-- '{151}'|16|'Микрорайон'|'Микрорайон'|'мкр'|'мкр.'|'микрорайон'|f
-- '{154,155}'|17|'Набережная'|'Набережная'|'наб'|'наб.'|'набережная'|f
-- '{162}'|18|'Парк'|'Парк'|'парк'|'парк'|'парк'|f
-- '{163,164}'|19|'Переулок'|'Переулок'|'пер'|'пер.'|'переулок'|f
-- '{165,166}'|20|'Переезд'|'Переезд'|'пер-д'|'переезд'|'переезд'|f
-- '{167,450}'|21|'Площадь'|'Площадь'|'пл'|'пл.'|'площадь'|f
-- '{174}'|22|'Проспект'|'Проспект'|'пр-кт'|'пр-кт'|'проспект'|f
-- '{171,176}'|23|'Проезд'|'Проезд'|'пр-д'|'проезд'|'проезд'|f
-- '{172,178}'|24|'Просек'|'Просек'|'пр-к'|'просек'|'просек'|f
-- '{173,179}'|25|'Просека'|'Просека'|'пр-ка'|'просека'|'просека'|f
-- ''|26|''|'Проток'|''|'проток'|'проток'|f
-- '{181,182}'|27|'Проулок'|'Проулок'|'проул.'|'проулок'|'проулок'|f
-- '{183,184}'|28|'Разъезд'|'Разъезд'|'рзд'|'рзд'|'разъезд'|f
-- '{189}'|30|'Сад'|'Сад'|'сад'|'сад'|'сад'|f
-- '{192,196}'|31|'Сквер'|'Сквер'|'сквер'|'сквер'|'сквер'|f
-- '{191,195}'|32|'Спуск'|'Спуск'|'с-к'|'спуск'|'спуск'|f
-- '{197}'|33|'Станция'|'Станция'|'ст'|'ст.'|'станция'|f
-- '{199}'|34|'Территория'|'Территория'|'тер'|'тер.'|'территория'|f
-- ''|35|''|'тоннель'|''|'тоннель'|'тоннель'|f
-- '{202}'|36|'Тракт'|'Тракт'|'тракт'|'тракт'|'тракт'|f
-- '{203,451}'|37|'Тупик'|'Тупик'|'туп'|'туп.'|'тупик'|f
-- '{204,205}'|38|'Улица'|'Улица'|'ул'|'ул.'|'улица'|f
-- '{206}'|39|'Участок'|'Участок'|'уч-к'|'уч-к'|'участок'|f
-- '{210,211}'|40|'Шоссе'|'Шоссе'|'ш'|'ш.'|'шоссе'|f
-- '{168}'|41|'Платформа'|'Платформа'|'платф'|'платф.'|'платформа'|f
-- '{141}'|42|'Километр'|'Километр'|'км'|'км.'|'километр'|f
-- '{123}'|43|'Городок'|'Городок'|'г-к'|'г-к'|'городок'|f
-- '{124}'|44|'Гаражно-строительный кооп.'|'Гаражно-строительный кооп.'|'гск'|'гск'|'гаражностроительныйкооп'|f
-- '{139}'|45|'Казарма'|'Казарма'|'казарма'|'казарма'|'казарма'|f
-- '{147}'|46|'Местечко'|'Местечко'|'м'|'м'|'местечко'|f
-- '{157}'|47|'Остров'|'Остров'|'остров'|'остров'|'остров'|f
-- ''|48|''|'Ряд'|''|'ряд'|'ряд'|f
-- '{126}'|49|'Дачное неком-е партнерство'|'Дачное неком-е партнерство'|'днп'|'днп'|'дачноенекомепартнерство'|f
-- '{127}'|50|'Дорога'|'Дорога'|'дор'|'дор'|'дорога'|f
-- '{148}'|51|'Маяк'|'Маяк'|'маяк'|'маяк'|'маяк'|f
-- '{149}'|52|'Магистраль'|'Магистраль'|'мгстр.'|'мгстр.'|'магистраль'|f
-- '{153}'|53|'Некоммерческое партнерство'|'Некоммерческое партнерство'|'н/п'|'н/п'|'некоммерческоепартнерство'|f
-- '{160}'|54|'Планировочный район'|'Планировочный район'|'пл.р-н'|'пл.р-н'|'планировочныйрайон'|f
-- '{170}'|55|'Полустанок'|'Полустанок'|'полустанок'|'полустанок'|'полустанок'|f
-- '{200}'|56|'Территория ДНТ'|'Территория ДНТ'|'тер. ДНТ'|'тер. ДНТ'|'территорияднт'|f
-----------------------------------------------------------------------------------------
SELECT * FROM gar_tmp.xxx_adr_area WHERE ( fias_guid IN (

 '66641bf7-2f1f-4d78-b17e-71bfbfa1c995'
,'ca79c14d-3770-4c55-91d0-fbb4561e509b'
,'ee68df6c-6e49-469b-8fc1-ccba3ed6cbda'
,'f8cc583a-1e69-4ce0-944c-da6bdd4c110e'
,'0755bd9b-93bf-490a-a99d-76aebba0b5b9'
,'97299168-9004-412a-ae9c-558d4356c606'
,'43c3311c-9cc2-494c-8065-98f62396d78c'
,'ccb32695-884a-4961-8bd7-c9e5a356f9ad'
,'58f733ae-fda3-4cf1-8f77-52409f62bc6e'
,'c07a62d5-8ea3-47a6-b989-6f88b0a99429'
,'efbb0998-3d73-4071-9ccb-09a86c293b86'
,'214ae2fd-7d99-43b5-8488-eb849d00629d'
,'3197392a-8889-431d-b162-3f44fa2c0b56'
,'a3a2bbec-06a8-4f14-9a89-665b4fa75b95'
,'f2f1d515-8536-4442-b44d-2544c5c39e95'
,'f447f6c0-5d94-4033-b72a-4116bcc08a6b'
,'fc826836-3d68-465e-a176-ffa0568bceec'
));
---------------------------------------------------
SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '0c1e84bc-7cb0-48aa-9523-e4386e3c21e3'::uuid);
SELECT * FROM gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '43c3311c-9cc2-494c-8065-98f62396d78c'::uuid);
---------------------------------------------------------------------------------------------------------
 SELECT * FROM gar_tmp_pcg_trans.f_zzz_adr_area_type_show_tmp_data ('gar_tmp'); 
 --------------------------------------------------------------------------------------------------------------------
-- 1|'Аал'|'аал'|0|''|'{46,241}'|1|'Аал'|'Аал'|'аал'|'аал'|'аал'
-- 2|'Автономный округ'|'АО'|0|''|'{3,4,17}'|2|'Автономный округ'|'Автономный округ'|'а.окр.'|'АО'|'автономныйокруг'
-- 3|'Автономная область'|'Аобл'|0|''|'{2,5}'|3|'Автономная область'|'Автономная область'|'а.обл.'|'Аобл'|'автономнаяобласть'
-- 4|'Арбан'|'арбан'|0|''|'{48,243}'|4|'Арбан'|'Арбан'|'арбан'|'арбан'|'арбан'
-- 5|'Аул'|'аул'|0|''|'{49,244}'|5|'Аул'|'Аул'|'аул'|'аул'|'аул'
-- 6|'Выселки(ок)'|'высел.'|0|''|'{51}'|6|'Выселки(ок)'|'Выселки(ок)'|'высел'|'высел.'|'выселкиок'
-- 7|'Город'|'г.'|0|''|'{6,7,28,29,52,423,429}'|7|'Город'|'Город'|'г'|'г.'|'город'
-- 8|'Городок'|'городок'|0|''|'{53,249}'|8|'Городок'|'Городок'|'г-к'|'городок'|'городок'
-- 9|'городской поселок'|'гп'|0|''|'{54,433}'|9|'Городской поселок'|'городской поселок'|'гп'|'гп'|'городскойпоселок'
-- 10|'Деревня'|'д.'|0|''|'{55,251,434}'|10|'Деревня'|'Деревня'|'д'|'д.'|'деревня'
-- 11|'Дачный поселок'|'дп'|0|''|'{30,56,57}'|11|'Дачный поселок'|'Дачный поселок'|'дп'|'дп'|'дачныйпоселок'
-- 12|'Железнодорожная будка'|'ж/д_будка'|0|''|'{58,67,254}'|12|'Железнодорожная будка'|'Железнодорожная будка'|'ж/д б-ка'|'ж/д_будка'|'железнодорожнаябудка'
-- 13|'Железнодорожная казарма'|'ж/д_казарм'|0|''|'{61,68,255}'|13|'Железнодорожная казарма'|'Железнодорожная казарма'|'ж/д к-ма'|'ж/д_казарм'|'железнодорожнаяказарма'
-- 14|'ж/д останов. (обгонный) пункт'|'ж/д_оп'|0|''|'{69}'|14|'ж/д останов. (обгонный) пункт'|'ж/д останов. (обгонный) пункт'|'ж/д_оп'|'ж/д_оп'|'ждостановобгонныйпункт'
-- 15|'Железнодорожная платформа'|'ж/д_платф'|0|''|'{66,70,256}'|15|'Железнодорожная платформа'|'Железнодорожная платформа'|'ж/д пл-ма'|'ж/д_платф'|'железнодорожнаяплатформа'
-- 16|'Железнодорожный пост'|'ж/д_пост'|0|''|'{71}'|16|'Железнодорожный пост'|'Железнодорожный пост'|'ж/д_пост'|'ж/д_пост'|'железнодорожныйпост'
-- 17|'Железнодорожный разъезд'|'ж/д_рзд'|0|''|'{72,257,436}'|17|'Железнодорожный разъезд'|'Железнодорожный разъезд'|'ж/д_рзд'|'ж/д_рзд'|'железнодорожныйразъезд'
-- 18|'Железнодорожная станция'|'ж/д_ст'|0|''|'{73,258,435}'|18|'Железнодорожная станция'|'Железнодорожная станция'|'ж/д_ст'|'ж/д_ст'|'железнодорожнаястанция'
-- 19|'Жилая зона'|'жилзона'|0|''|'{74}'|19|'Жилая зона'|'Жилая зона'|'жилзона'|'жилзона'|'жилаязона'
-- 20|'Жилой район'|'жилрайон'|0|''|'{75,259}'|20|'Жилой район'|'Жилой район'|'жилрайон'|'жилрайон'|'жилойрайон'
-- 21|'Заимка'|'заимка'|0|''|'{76,437}'|21|'Заимка'|'Заимка'|'заимка'|'заимка'|'заимка'
-- 22|'Казарма'|'казарма'|0|''|'{78}'|22|'Казарма'|'Казарма'|'казарма'|'казарма'|'казарма'
-- 23|'Квартал'|'кв-л'|0|''|'{79,262}'|23|'Квартал'|'Квартал'|'кв-л'|'кв-л'|'квартал'
-- 24|'Кордон'|'кордон'|0|''|'{81}'|24|'Кордон'|'Кордон'|'кордон'|'кордон'|'кордон'
-- 25|'Курортный поселок'|'кп'|0|''|'{31,82,438}'|25|'Курортный поселок'|'Курортный поселок'|'кп'|'кп'|'курортныйпоселок'
-- 26|'Край'|'край'|0|''|'{9}'|26|'Край'|'Край'|'край'|'край'|'край'
-- 27|'Леспромхоз'|'лпх'|0|''|'{83}'|27|'Леспромхоз'|'Леспромхоз'|'лпх'|'лпх'|'леспромхоз'
-- 28|'Местечко'|'м.'|0|''|'{84,269,439}'|28|'Местечко'|'Местечко'|'м'|'м.'|'местечко'
-- 29|'Массив'|'массив'|0|''|'{32,85}'|29|'Массив'|'Массив'|'массив'|'массив'|'массив'
-- 30|'Микрорайон'|'мкр.'|0|''|'{86,270,271}'|30|'Микрорайон'|'Микрорайон'|'мкр'|'мкр.'|'микрорайон'
-- 31|'Населенный пункт'|'нп'|0|''|'{87,88}'|31|'Населенный пункт'|'Населенный пункт'|'нп'|'нп'|'населенныйпункт'
-- 32|'Область'|'обл.'|0|''|'{10,11}'|32|'Область'|'Область'|'обл'|'обл.'|'область'
-- 33|'Остров'|'остров'|0|''|'{89,275}'|33|'Остров'|'Остров'|'остров'|'остров'|'остров'
-- 34|'Поселок'|'п.'|0|''|'{33,90,276,440}'|34|'Поселок'|'Поселок'|'п'|'п.'|'поселок'
-- 35|'Поселение'|'поселение'|0|''|'{21,22}'|35|'Поселение'|'Поселение'|'п'|'поселение'|'поселение'
-- 36|'Поселок и(при) станция(и)'|'п/ст'|0|''|'{94}'|36|'Поселок и(при) станция(и)'|'Поселок и(при) станция(и)'|'п/ст'|'п/ст'|'поселокипристанцияи'
-- 37|'Поселок городского типа'|'пгт'|0|''|'{35,36,95,96}'|37|'Поселок городского типа'|'Поселок городского типа'|'пгт'|'пгт'|'поселокгородскоготипа'
-- 38|'Починок'|'починок'|0|''|'{99,281,442}'|38|'Починок'|'Починок'|'починок'|'починок'|'починок'
-- 39|'Промышленная зона'|'промзона'|0|''|'{100,291}'|39|'Промышленная зона'|'Промышленная зона'|'промзона'|'промзона'|'промышленнаязона'
-- 40|'Район'|'р-н'|0|''|'{23,294,44}'|40|'Район'|'Район'|'р-н'|'р-н'|'район'
-- 41|'Республика'|'Респ'|0|''|'{13,14}'|41|'Республика'|'Республика'|'Респ'|'Респ'|'республика'
-- 42|'Разъезд'|'рзд'|0|''|'{101,293,444}'|42|'Разъезд'|'Разъезд'|'рзд'|'рзд'|'разъезд'
-- 43|'Рабочий поселок'|'рп'|0|''|'{37,102,430,443}'|43|'Рабочий поселок'|'Рабочий поселок'|'рп'|'рп'|'рабочийпоселок'
-- 44|'Село'|'с'|0|''|'{103,295,426,431,445}'|44|'Село'|'Село'|'с'|'с'|'село'
-- 45|'Сельская администрация'|'с/а'|0|''|'{38}'|45|'Сельская администрация'|'Сельская администрация'|'с/а'|'с/а'|'сельскаяадминистрация'
-- 46|'Сельское муницип.образование'|'с/мо'|0|''|'{39}'|46|'Сельское муницип.образование'|'Сельское муницип.образование'|'с/мо'|'с/мо'|'сельскоемуниципобразование'
-- 47|'Сельский округ'|'с/о'|0|''|'{40}'|47|'Сельский округ'|'Сельский округ'|'с/о'|'с/о'|'сельскийокруг'
-- 48|'Сельское поселение'|'с/п'|0|''|'{418,41}'|48|'сельское поселение'|'Сельское поселение'|'с.п.'|'с/п'|'сельскоепоселение'
-- 49|'Сельсовет'|'с/с'|0|''|'{42}'|49|'Сельсовет'|'Сельсовет'|'с/с'|'с/с'|'сельсовет'
-- 50|'Слобода'|'сл'|0|''|'{104,299,446}'|50|'Слобода'|'Слобода'|'сл'|'сл'|'слобода'
-- 51|'Садовое неком-е товарищество'|'снт'|0|''|'{105,340,194,300,402}'|51|'Садовое неком-е товарищество'|'Садовое неком-е товарищество'|'снт'|'снт'|'садовоенекометоварищество'
-- 52|'Станция'|'ст'|0|''|'{108,302,447}'|52|'Станция'|'Станция'|'ст'|'ст'|'станция'
-- 53|'Станица'|'ст-ца'|0|''|'{109}'|53|'Станица'|'Станица'|'ст-ца'|'ст-ца'|'станица'
-- 54|'Территория'|'тер'|0|''|'{24,43,110,304,305}'|54|'Территория'|'Территория'|'тер'|'тер'|'территория'
-- 55|'Улус'|'у'|0|''|'{25,26,111,448}'|55|'Улус'|'Улус'|'у'|'у'|'улус'
-- 56|'Хутор'|'х'|0|''|'{112,329,449}'|56|'Хутор'|'Хутор'|'х'|'х'|'хутор'
-- 57|'Дачное неком-е партнерство'|'днп'|0|''|'{252}'|57|'Дачное неком-е партнерство'|'Дачное неком-е партнерство'|'днп'|'днп'|'дачноенекомепартнерство'
-- 58|'Территория ДНП'|'тер. ДНП'|0|''|'{308}'|58|'Территория ДНП'|'Территория ДНП'|'тер. ДНП'|'тер. ДНП'|'территорияднп'
-- 59|'Территория ДНТ'|'тер. ДНТ'|0|''|'{309}'|59|'Территория ДНТ'|'Территория ДНТ'|'тер. ДНТ'|'тер. ДНТ'|'территорияднт'
-- 60|'Территория СНТ'|'тер. СНТ'|0|''|'{318}'|60|'Территория СНТ'|'Территория СНТ'|'тер. СНТ'|'тер. СНТ'|'территорияснт'
-- 61|'Территория ТСН'|'тер. ТСН'|0|''|'{321}'|61|'Территория ТСН'|'Территория ТСН'|'тер. ТСН'|'тер. ТСН'|'территориятсн'
-- 62|'Город федерального значения'|'г.ф.з.'|0|''|'{8}'|62|'Город федерального значения'|'Город федерального значения'|'г.ф.з.'|'г.ф.з.'|'городфедеральногозначения'
-- 63|'Округ'|'округ'|0|''|'{12}'|63|'Округ'|'Округ'|'округ'|'округ'|'округ'
-- 64|'Чувашия'|'Чувашия'|0|''|'{15}'|64|'Чувашия'|'Чувашия'|'Чувашия'|'Чувашия'|'чувашия'
-- 65|'Внутригородская территория'|'вн.тер. г.'|0|''|'{18}'|65|'Внутригородская территория'|'Внутригородская территория'|'вн.тер. г.'|'вн.тер. г.'|'внутригородскаятерритория'
-- 66|'Городской округ'|'г.о.'|0|''|'{19,414}'|66|'Городской округ'|'Городской округ'|'г.о.'|'г.о.'|'городскойокруг'
-- 67|'Муниципальный район'|'м.р-н'|0|''|'{20,416}'|67|'Муниципальный район'|'Муниципальный район'|'м.р-н'|'м.р-н'|'муниципальныйрайон'
-- 68|'Волость'|'волость'|0|''|'{27,50}'|68|'Волость'|'Волость'|'волость'|'волость'|'волость'
-- 69|'Почтовое отделение'|'п/о'|0|''|'{34,92}'|69|'Почтовое отделение'|'Почтовое отделение'|'п/о'|'п/о'|'почтовоеотделение'
-- 70|'Автодорога'|'автодорога'|0|''|'{47}'|70|'Автодорога'|'Автодорога'|'автодорога'|'автодорога'|'автодорога'
-- 71|'Железнодорожный блокпост'|'ж/д бл-ст'|0|''|'{59}'|71|'Железнодорожный блокпост'|'Железнодорожный блокпост'|'ж/д бл-ст'|'ж/д бл-ст'|'железнодорожныйблокпост'
-- 72|'Железнодорожная ветка'|'ж/д в-ка'|0|''|'{60}'|72|'Железнодорожная ветка'|'Железнодорожная ветка'|'ж/д в-ка'|'ж/д в-ка'|'железнодорожнаяветка'
-- 73|'Железнодорожный комбинат'|'ж/д к-т'|0|''|'{62}'|73|'Железнодорожный комбинат'|'Железнодорожный комбинат'|'ж/д к-т'|'ж/д к-т'|'железнодорожныйкомбинат'
-- 74|'Железнодорожный остановочный пункт'|'ж/д о.п.'|0|''|'{63}'|74|'Железнодорожный остановочный пункт'|'Железнодорожный остановочный пункт'|'ж/д о.п.'|'ж/д о.п.'|'железнодорожныйостановочныйпункт'
-- 75|'Железнодорожный путевой пост'|'ж/д п.п.'|0|''|'{64}'|75|'Железнодорожный путевой пост'|'Железнодорожный путевой пост'|'ж/д п.п.'|'ж/д п.п.'|'железнодорожныйпутевойпост'
-- 76|'Железнодорожная площадка'|'ж/д пл-ка'|0|''|'{65}'|76|'Железнодорожная площадка'|'Железнодорожная площадка'|'ж/д пл-ка'|'ж/д пл-ка'|'железнодорожнаяплощадка'
-- 77|'Зимовье'|'зим.'|0|''|'{77}'|77|'Зимовье'|'Зимовье'|'зим.'|'зим.'|'зимовье'
-- 78|'Кишлак'|'киш.'|0|''|'{80}'|78|'Кишлак'|'Кишлак'|'киш.'|'киш.'|'кишлак'
-- 79|'Поселок при железнодорожной станции'|'п. ж/д ст.'|0|''|'{91}'|79|'Поселок при железнодорожной станции'|'Поселок при железнодорожной станции'|'п. ж/д ст.'|'п. ж/д ст.'|'поселокприжелезнодорожнойстанции'
-- 80|'Планировочный район'|'пл.р-н'|0|''|'{93,160,381}'|80|'Планировочный район'|'Планировочный район'|'пл.р-н'|'пл.р-н'|'планировочныйрайон'
-- 81|'Погост'|'погост'|0|''|'{97}'|81|'Погост'|'Погост'|'погост'|'погост'|'погост'
-- 82|'Поселок разъезда'|'пос.рзд'|0|''|'{98,441}'|82|'Поселок разъезда'|'Поселок разъезда'|'пос.рзд'|'пос.рзд'|'поселокразъезда'
-- 83|'Сельский поселок'|'сп'|0|''|'{106,107}'|83|'Сельский поселок'|'Сельский поселок'|'сп'|'сп'|'сельскийпоселок'
-- 84|'Абонентский ящик'|'а/я'|0|''|'{240}'|84|'Абонентский ящик'|'Абонентский ящик'|'а/я'|'а/я'|'абонентскийящик'
-- 85|'Аллея'|'ал.'|0|''|'{242}'|85|'Аллея'|'Аллея'|'ал.'|'ал.'|'аллея'
-- 86|'Берег'|'б-г'|0|''|'{245}'|86|'Берег'|'Берег'|'б-г'|'б-г'|'берег'
-- 87|'Бульвар'|'б-р'|0|''|'{246}'|87|'Бульвар'|'Бульвар'|'б-р'|'б-р'|'бульвар'
-- 88|'Вал'|'вал'|0|''|'{247}'|88|'Вал'|'Вал'|'вал'|'вал'|'вал'
-- 89|'Въезд'|'взд.'|0|''|'{248}'|89|'Въезд'|'Въезд'|'взд.'|'взд.'|'въезд'
-- 90|'Гаражно-строительный кооп.'|'гск'|0|''|'{250}'|90|'Гаражно-строительный кооп.'|'Гаражно-строительный кооп.'|'гск'|'гск'|'гаражностроительныйкооп'
-- 91|'Дорога'|'дор.'|0|''|'{253}'|91|'Дорога'|'Дорога'|'дор.'|'дор.'|'дорога'
-- 92|'Заезд'|'ззд.'|0|''|'{260}'|92|'Заезд'|'Заезд'|'ззд.'|'ззд.'|'заезд'
-- 93|'Зона (массив)'|'зона'|0|''|'{261}'|93|'Зона (массив)'|'Зона (массив)'|'зона'|'зона'|'зонамассив'
-- 94|'Километр'|'км'|0|''|'{263}'|94|'Километр'|'Километр'|'км'|'км'|'километр'
-- 95|'Коса'|'коса'|0|''|'{264}'|95|'Коса'|'Коса'|'коса'|'коса'|'коса'
-- 96|'Кольцо'|'к-цо'|0|''|'{265}'|96|'Кольцо'|'Кольцо'|'к-цо'|'к-цо'|'кольцо'
-- 97|'Линия'|'лн.'|0|''|'{266}'|97|'Линия'|'Линия'|'лн.'|'лн.'|'линия'
-- 98|'Местность'|'местность'|0|''|'{267}'|98|'Местность'|'Местность'|'местность'|'местность'|'местность'
-- 99|'Месторождение'|'месторожд.'|0|''|'{268,272}'|99|'Месторождение'|'Месторождение'|'месторожд.'|'месторожд.'|'месторождение'
-- 100|'Некоммерческое партнерство'|'н/п'|0|''|'{273}'|100|'Некоммерческое партнерство'|'Некоммерческое партнерство'|'н/п'|'н/п'|'некоммерческоепартнерство'
-- 101|'Набережная'|'наб.'|0|''|'{274}'|101|'Набережная'|'Набережная'|'наб.'|'наб.'|'набережная'
-- 102|'Промышленный район'|'п/р'|0|''|'{277}'|102|'Промышленный район'|'Промышленный район'|'п/р'|'п/р'|'промышленныйрайон'
-- 103|'Парк'|'парк'|0|''|'{278}'|103|'Парк'|'Парк'|'парк'|'парк'|'парк'
-- 104|'Переезд'|'пер-д'|0|''|'{280}'|104|'Переезд'|'Переезд'|'пер-д'|'пер-д'|'переезд'
-- 105|'Платформа'|'платф.'|0|''|'{283,168,387}'|105|'Платформа'|'Платформа'|'платф.'|'платф.'|'платформа'
-- 106|'Площадка'|'пл-ка'|0|''|'{284,169,388}'|106|'Площадка'|'Площадка'|'пл-ка'|'пл-ка'|'площадка'
-- 107|'Порт'|'порт'|0|''|'{285}'|107|'Порт'|'Порт'|'порт'|'порт'|'порт'
-- 108|'Просек'|'пр-к'|0|''|'{287}'|108|'Просек'|'Просек'|'пр-к'|'пр-к'|'просек'
-- 109|'Просека'|'пр-ка'|0|''|'{288}'|109|'Просека'|'Просека'|'пр-ка'|'пр-ка'|'просека'
-- 110|'Проспект'|'пр-кт'|0|''|'{289}'|110|'Проспект'|'Проспект'|'пр-кт'|'пр-кт'|'проспект'
-- 111|'Проселок'|'пр-лок'|0|''|'{290}'|111|'Проселок'|'Проселок'|'пр-лок'|'пр-лок'|'проселок'
-- 112|'Проулок'|'проул.'|0|''|'{292}'|112|'Проулок'|'Проулок'|'проул.'|'проул.'|'проулок'
-- 113|'Сад'|'сад'|0|''|'{296}'|113|'Сад'|'Сад'|'сад'|'сад'|'сад'
-- 114|'Спуск'|'с-к'|0|''|'{297}'|114|'Спуск'|'Спуск'|'с-к'|'с-к'|'спуск'
-- 115|'Сквер'|'сквер'|0|''|'{298,301}'|115|'Сквер'|'Сквер'|'сквер'|'сквер'|'сквер'
-- 116|'Территория ГСК'|'тер. ГСК'|0|''|'{306}'|116|'Территория ГСК'|'Территория ГСК'|'тер. ГСК'|'тер. ГСК'|'территориягск'
-- 117|'Территория ДНО'|'тер. ДНО'|0|''|'{307}'|117|'Территория ДНО'|'Территория ДНО'|'тер. ДНО'|'тер. ДНО'|'территориядно'
-- 118|'Территория ДПК'|'тер. ДПК'|0|''|'{310}'|118|'Территория ДПК'|'Территория ДПК'|'тер. ДПК'|'тер. ДПК'|'территориядпк'
-- 119|'Территория ОНО'|'тер. ОНО'|0|''|'{311}'|119|'Территория ОНО'|'Территория ОНО'|'тер. ОНО'|'тер. ОНО'|'территорияоно'
-- 120|'Территория ОНП'|'тер. ОНП'|0|''|'{312}'|120|'Территория ОНП'|'Территория ОНП'|'тер. ОНП'|'тер. ОНП'|'территорияонп'
-- 121|'Территория ОНТ'|'тер. ОНТ'|0|''|'{313}'|121|'Территория ОНТ'|'Территория ОНТ'|'тер. ОНТ'|'тер. ОНТ'|'территорияонт'
-- 122|'Территория ОПК'|'тер. ОПК'|0|''|'{314}'|122|'Территория ОПК'|'Территория ОПК'|'тер. ОПК'|'тер. ОПК'|'территорияопк'
-- 123|'Территория ПК'|'тер. ПК'|0|''|'{315}'|123|'Территория ПК'|'Территория ПК'|'тер. ПК'|'тер. ПК'|'территорияпк'
-- 124|'Территория СНО'|'тер. СНО'|0|''|'{316}'|124|'Территория СНО'|'Территория СНО'|'тер. СНО'|'тер. СНО'|'территориясно'
-- 125|'Территория СНП'|'тер. СНП'|0|''|'{317}'|125|'Территория СНП'|'Территория СНП'|'тер. СНП'|'тер. СНП'|'территорияснп'
-- 126|'Территория СПК'|'тер. СПК'|0|''|'{319}'|126|'Территория СПК'|'Территория СПК'|'тер. СПК'|'тер. СПК'|'территорияспк'
-- 127|'Территория ТСЖ'|'тер. ТСЖ'|0|''|'{320}'|127|'Территория ТСЖ'|'Территория ТСЖ'|'тер. ТСЖ'|'тер. ТСЖ'|'территориятсж'
-- 128|'Территория СОСН'|'тер.СОСН'|0|''|'{322}'|128|'Территория СОСН'|'Территория СОСН'|'тер.СОСН'|'тер.СОСН'|'территориясосн'
-- 129|'Территория ФХ'|'тер.ф.х.'|0|''|'{323}'|129|'Территория ФХ'|'Территория ФХ'|'тер.ф.х.'|'тер.ф.х.'|'территорияфх'
-- 130|'Тракт'|'тракт'|0|''|'{324}'|130|'Тракт'|'Тракт'|'тракт'|'тракт'|'тракт'
-- 131|'Тупик'|'туп.'|0|''|'{325}'|131|'Тупик'|'Тупик'|'туп.'|'туп.'|'тупик'
-- 132|'Усадьба'|'ус.'|0|''|'{327}'|132|'Усадьба'|'Усадьба'|'ус.'|'ус.'|'усадьба'
-- 133|'Фермерское хозяйство'|'ф/х'|0|''|'{328}'|133|'Фермерское хозяйство'|'Фермерское хозяйство'|'ф/х'|'ф/х'|'фермерскоехозяйство'
-- 134|'Шоссе'|'ш.'|0|''|'{330}'|134|'Шоссе'|'Шоссе'|'ш.'|'ш.'|'шоссе'
-- 135|'Юрты'|'ю.'|0|''|'{331}'|135|'Юрты'|'Юрты'|'ю.'|'ю.'|'юрты'
-- 136|'городское поселение'|'г.п.'|0|''|'{419}'|136|'городское поселение'|'городское поселение'|'г.п.'|'г.п.'|'городскоепоселение'
-- 137|'внутригородской район'|'вн.р-н'|0|''|'{420}'|137|'внутригородской район'|'внутригородской район'|'вн.р-н'|'вн.р-н'|'внутригородскойрайон'
-- 138|'межселенная территория'|'межсел.тер'|0|''|'{421}'|138|'межселенная территория'|'межселенная территория'|'межсел.тер.'|'межсел.тер'|'межселеннаятерритория'
-- 139|'Муниципальный округ'|'м.о.'|0|''|'{422}'|139|'Муниципальный округ'|'Муниципальный округ'|'м.о.'|'м.о.'|'муниципальныйокруг'
-- 140|'Поселок при станции (поселок станции)'|'п. ст.'|0|''|'{425}'|140|'Поселок при станции (поселок станции)'|'Поселок при станции (поселок станции)'|'п. ст.'|'п. ст.'|'поселокпристанциипоселокстанции'
-- 141|'Садовое товарищество'|'с/т'|0|''|'{428}'|141|'Садовое товарищество'|'Садовое товарищество'|'с/т'|'с/т'|'садовоетоварищество'
-- 142|'Выселки'|'в-ки'|0|''|'{432}'|142|'Выселки'|'Выселки'|'в-ки'|'в-ки'|'выселки'
------------------------------------------------
 SELECT * FROM gar_tmp_pcg_trans.f_zzz_adr_area_type_show_tmp_data ('gar_tmp'); 
 SELECT * FROM gar_tmp_pcg_trans.f_zzz_street_type_show_tmp_data ('gar_tmp'); 
 SELECT * FROM gar_tmp_pcg_trans.f_zzz_house_type_show_tmp_data ('gar_tmp'); 
----------------------------------------------------------------------------
SELECT * FROM gar_tmp.xxx_adr_street_gap;

-- SELECT g.*, x.* FROM gar_tmp.xxx_adr_area_type x 
--    INNER JOIN gar_tmp.xxx_adr_street_gap g ON (x.fias_row_key = gar_tmp_pcg_trans.f_xxx_replace_char (g.nm_street_type))
--     UNION 
SELECT  DISTINCT on (g.nm_street_full)  g.*, x.* FROM gar_tmp.xxx_adr_area_type x 
   INNER JOIN gar_tmp.xxx_adr_street_gap g ON (lower(x.fias_type_shortname) = lower(g.nm_street_type))
 --
 SELECT  DISTINCT on (g.nm_street_full)  g.*, x.* FROM gar_tmp.xxx_adr_area_type x 
   INNER JOIN gar_tmp.xxx_adr_street_gap g ON (lower(x.fias_type_shortname) = lower(g.nm_street_type))
 WHERE NOT(g.id_street_type = ANY(x.fias_ids));	
--
SELECT g.*, x.* FROM gar_tmp.xxx_adr_street_type x  
INNER JOIN gar_tmp.xxx_adr_area_gap g ON (x.nm_street_type_short = g.nm_area_type)
--
SELECT g.*, x.* FROM gar_tmp_pcg_trans.f_zzz_street_type_show_tmp_data ('gar_tmp') x  
INNER JOIN gar_tmp.xxx_adr_area_gap g ON (x.nm_street_type_short = g.nm_area_type) 
 WHERE NOT(g.id_area_type = ANY(x.fias_ids));	

--  SELECT * FROM gar_tmp_pcg_trans.f_zzz_adr_area_type_show_tmp_data ('gar_tmp') x;   
 SELECT  DISTINCT on (g.nm_street_full)  g.*, x.* FROM gar_tmp_pcg_trans.f_zzz_adr_area_type_show_tmp_data ('gar_tmp') x
   INNER JOIN gar_tmp.xxx_adr_street_gap g ON (lower(x.fias_type_shortname) = lower(g.nm_street_type))
 WHERE NOT(g.id_street_type = ANY(x.fias_ids));	
 --
 -- SELECT * FROM gar_tmp_pcg_trans.f_zzz_house_type_show_tmp_data ('gar_tmp') x;
 SELECT  DISTINCT on (g.nm_parent_obj)  g.*, x.* FROM gar_tmp_pcg_trans.f_zzz_adr_area_type_show_tmp_data ('gar_tmp') x
   INNER JOIN gar_tmp.xxx_adr_house_gap g ON (lower(x.fias_type_shortname) = lower(g.parent_type_shortname));
 WHERE NOT(g.parent_type_id = ANY(x.fias_ids));