SELECT id_street, id_area, nm_street, id_street_type, nm_street_full, nm_fias_guid, dt_data_del, id_data_etalon, kd_kladr, vl_addr_latitude, vl_addr_longitude, id_street_hist, date_create, f_server_name, id_region
FROM gar_tmp.adr_street_hist WHERE (nm_street = 'Садовая');
-- 931568|192331|'Садовая'|38|'Садовая ул.'|'806c00f0-64b1-496b-ac23-143664ef687d'|'2023-01-08 20:16:11.569228'|931568

SELECT * FROM gar_tmp.adr_street WHERE (id_street = 931568);
-- 931568|192331|'Садовая'|38|'Садовая ул.'|'31524a8d-f5df-4a22-9697-1791caf72692'

SELECT h.id_street, h.id_area, h.nm_street, h.id_street_type, h.nm_street_full, h.nm_fias_guid, h.dt_data_del, h.id_region, 
       s.id_area, s.nm_street, s.id_street_type, s.nm_street_full, s.nm_fias_guid 
FROM gar_tmp.adr_street_hist h
 INNER JOIN gar_tmp.adr_street s ON ( h.id_street = s.id_street)

WHERE NOT (h.nm_fias_guid = s.nm_fias_guid)
ORDER BY s.id_area, s.nm_street, s.id_street_type, h.dt_data_del DESC;

SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '4ce0359d-938d-4a42-bd7e-ff33e814e4bc')  
UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '99a575f6-6ae6-4781-a529-561179501293');  
--------------------------------------------------------------------------------------------------------------------------------------------------------
--   104675|    86648|'4ce0359d-938d-4a42-bd7e-ff33e814e4bc'|   243171|'Садовая'|204|'ул' |8|30|104634|     0|'2018-01-13'|'2015-03-28'|'2079-06-06'|t|f
--   104634|    86648|'4ce0359d-938d-4a42-bd7e-ff33e814e4bc'|   243114|'Садовая'|204|'ул' |8|10|     0|104675|'2017-12-26'|'2015-03-27'|'2015-03-28'|f|f
-- 52042846|158405482|'99a575f6-6ae6-4781-a529-561179501293'|498675740|'Садовая'|205|'ул.'|8|10|     0|     0|'2023-03-27'|'2023-03-27'|'2079-06-06'|t|t
-- -----------------------------------------------------------------------------------------------------------------------------------------------------
SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('4ce0359d-938d-4a42-bd7e-ff33e814e4bc'); -- НЕТ
SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('99a575f6-6ae6-4781-a529-561179501293'); -- НЕТ
------------------------------------------------------------------------------------------------
-- 158405482|84516|'99a575f6-6ae6-4781-a529-561179501293'|'024189e9-9f46-4347-a8fe-41cf2d2586d1'|'Садовая'|205|'ул.'|8|'Элемент улично-дорожной сети'|'5'|498675740|0|10|'Добавление'|'2023-03-27'|'2079-06-06'|t|t|'{158405482}'|0
-- 84516|83462|'024189e9-9f46-4347-a8fe-41cf2d2586d1'|'35f01ea7-5e6d-42ec-9dd3-0bf62002ff17'|'Хазар'|103|'с'|6|'Населенный пункт'|'5'|237768|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516}'|-1
-- 83462|78545|'35f01ea7-5e6d-42ec-9dd3-0bf62002ff17'|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|'Дербентский'|23|'р-н'|2|'Административный район'|'5'|235021|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516,83462}'|-2
-- 78545|0|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|''|'Дагестан'|13|'Респ'|1|'Субъект РФ'|'5'|222788|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|t|t|'{158405482,84516,83462,78545}'|-3
--
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '4ce0359d-938d-4a42-bd7e-ff33e814e4bc'::uuid, p_qty := 0) ; -- нет
SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '99a575f6-6ae6-4781-a529-561179501293'::uuid, p_qty := 0) ; 
--
--  Обновлению UUID произошло один раз.
--   Теперь многократное обновление
--  

-- 931568	192331	Садовая	38	Садовая ул.	806c00f0-64b1-496b-ac23-143664ef687d	2023-10-25 11:05:35.035649	0	192331	Садовая	38	Садовая ул.	31524a8d-f5df-4a22-9697-1791caf72692
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '806c00f0-64b1-496b-ac23-143664ef687d')  
     UNION ALL
SELECT a.* FROM gar_fias.as_addr_obj a WHERE (a.object_guid = '31524a8d-f5df-4a22-9697-1791caf72692');  

-- 97720|81088|'806c00f0-64b1-496b-ac23-143664ef687d'|229421|'Садовая'|204|'ул'|8|10|0|0|'2018-09-20'|'2016-10-19'|'2079-06-06'|t|t
-- 93774|77883|'31524a8d-f5df-4a22-9697-1791caf72692'|221038|'Садовая'|204|'ул'|8|10|0|0|'2018-03-12'|'2013-04-09'|'2079-06-06'|t|t

-- 931568	192331	Садовая	38	Садовая ул.	806c00f0-64b1-496b-ac23-143664ef687d	2023-10-25 11:05:35.035649	0	192331	Садовая	38	Садовая ул.	31524a8d-f5df-4a22-9697-1791caf72692

SELECT * FROM gar_fias_pcg_load.f_addr_obj_get_parents ('806c00f0-64b1-496b-ac23-143664ef687d');
------------------------------------------------------------------------------------------------
-- 81088|84653|'806c00f0-64b1-496b-ac23-143664ef687d'|'aece773e-5c5a-4dbe-8455-aa542f548704'|'Садовая'|204|'ул'|8|'Элемент улично-дорожной сети'
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'
-- 78727|78545|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|'Махачкала'|28|'г'|5|'Город'
-- 78545|0|'0bb7fa19-736d-49cf-ad0e-9774c4dae09b'|''|'Дагестан'|13|'Респ'|1|'Субъект РФ'

SELECT * FROM gar_fias_pcg_load."_NEW_f_adr_area_show_data" (p_fias_guid := '727cdf1e-1b70-4e07-8995-9bf7ca9abefb'::uuid, p_qty := 1) ; 
---------------------------------------------------------------------------------------------------------------------------------------
-- 84653|78727|'aece773e-5c5a-4dbe-8455-aa542f548704'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4093'|'0'|238149|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84653|'{78727,84653}'|2
-- 75729|78727|'6a5b8826-dc74-4694-bbba-776daa464be1'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Локомотив'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'31'|'0'|'0'|214539|91108|20|'Изменение'|'2012-12-25'|'2079-06-06'|84653|'{78727,75729}'|2
-- 75661|78727|'629a5247-b5e9-4abe-b420-ea7373a15cdc'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'29'|'0'|'0'|214342|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84783|'{78727,75661}'|2
-- 84783|78727|'c3cc37d3-b48d-4e6c-a160-082b8b3f0e29'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Нефтекачка'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'4052'|'0'|238516|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84783|'{78727,84783}'|2
-- 84564|78727|'8b8064d2-0262-4842-beca-0dc01360bd05'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3993'|'0'|237919|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84564|'{78727,84564}'|2
-- 75740|78727|'0f617717-1040-4742-bfb2-0eaaa040d4fa'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Садовод'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'32'|'0'|'0'|214567|0|10|'Добавление'|'2011-11-11'|'2079-06-06'|84564|'{78727,75740}'|2
-- 84454|78727|'450279b7-39ac-4e99-a505-10dd7b675d3d'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|262|'кв-л'|7|'Элемент планировочной структуры'|'5'|'0'|'1'|'0'|'3768'|'0'|237640|0|10|'Добавление'|'2016-10-19'|'2079-06-06'|84454|'{78727,84454}'|2
-- 75761|78727|'0e4ebdbe-e302-4237-94db-0c168f22b5db'|'727cdf1e-1b70-4e07-8995-9bf7ca9abefb'|'Урожай'|79|'кв-л'|6|'Населенный пункт'|'5'|'0'|'1'|'33'|'0'|'0'|214694|91153|20|'Изменение'|'2012-12-25'|'2079-06-06'|84454|'{78727,75761}'|2

