-- 2024-01-20
   
   -- Необходимо проверить работу обновления эталона, куда грузятся обновления из ФИАС.
   -- Пример ошибки:
   -- ошибочный индекс у села в Дагестане: Дагестан Респ, Новолакский р-н, Чапаево с
   -- Индекс ФИАС: 368160
   -- Индекс в нашем адресном справочнике: 368168   
   
BEGIN;
 SELECT * FROM unnsi.adr_area WHERE (nm_fias_guid = '1a91684d-7af5-4f5e-acf3-d33fe8e3351a');
 UPDATE unnsi.adr_area SET nm_zipcode = '368160'  WHERE (nm_fias_guid = '1a91684d-7af5-4f5e-acf3-d33fe8e3351a');
 SELECT * FROM unnsi.adr_area WHERE (nm_fias_guid = '1a91684d-7af5-4f5e-acf3-d33fe8e3351a');
 SELECT * FROM unnsi.adr_area WHERE (nm_zipcode = '368160');
ROLLBACK;
COMMIT;
------------------------------------------------------------------------------------
-- id_area	id_country	nm_area	nm_area_full	id_area_type	id_area_parent	kd_timezone	pr_detailed	kd_oktmo	nm_fias_guid	dt_data_del	id_data_etalon	kd_okato	nm_zipcode	kd_kladr	vl_addr_latitude	vl_addr_longitude
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- 10460	185	Шушия	Дагестан Респ, Новолакский р-н, Шушия с	            44	254	2	0	82639495101  c07d88ce-5388-4ef6-a2d7-3742f8d60798  NULL	NULL	82239000008	368160	5028000012	NULL	NULL
-- 10450	185	Новолакское	Дагестан Респ, Новолакский р-н, Новолакское с	44	254	2	0	82639444101  10f8c173-e7fa-4e0f-9476-85f6de4e776f  NULL	NULL	82239000001	368160	5028000001	NULL	NULL
-- 10447	185	Ямансу	Дагестан Респ, Новолакский р-н, Ямансу с	        44	254	2	0	82639497101  b7f383ed-b01f-4797-a397-e896edc3b6cd  NULL	NULL	82239000009	368160	5028000018	NULL	NULL
-- 10449	185	Дучи	Дагестан Респ, Новолакский р-н, Дучи с	            44	254	2	0	82639498101  b4655303-2243-4d97-b0b9-cba6d27cfef6  NULL	NULL	82239835001	368160	5028000019	NULL	NULL
-- 10461	185	Чапаево	Дагестан Респ, Новолакский р-н, Чапаево с	        44	254	2	0	82639494101  1a91684d-7af5-4f5e-acf3-d33fe8e3351a  NULL	NULL	82239000007	368160	5028000011	NULL	NULL
