/*=================================================================*/
/* DBMS name:      PostgreSQL 9                                    */
/* Created on:     19.08.2013 19:55:00                             */
/* --------------------------------------------------------------- */
/*  При создании оъектов в базе необходимо в имени объекта явно    */
/*  указывать схему, например: CREATE VEIW nso.xxx_yy_zz ..., либо */
/*  явно устанавливать текущий путь поиска командой SET, например, */
/*  SET searchpath=nso; CREATE VIEW xxx_yyy_zz ...                 */
/*  Для выполнения команд SELECT можно опустить команду SET, либо  */
/*  уточнение имени. Например будут корректно работать два запроса:*/
/*                SELECT * FROM obj_codifier;                      */
/*                SELECT * FROM ind_type;                          */
/* --------------------------------------------------------------- */
/*  По умолчанию любой объект будет создан в схеме public.         */
/*=================================================================*/
/* 2013-10-24  Новая схема объектов, остальное - старое.           */
/* 2013-12-12  Новый процедурный слой у НСО, новый ГИС ( РОО )     */ 
/* 2014-03-12  Новый процедурный слой у НСО, новая схема объектов, */
/*             новая схема показателей. Пустая схема "Документы".  */
/* 2014-07-02 Новая версия БД ЕМД - 3.0                            */
/* ----------------------------------------------------------------*/
/* 2015-04-05 Домен ЕБД.                                           */
/* 2015-12-11 Две базы: боевая RED LEVEL, тестовая YELLOW LEVEL    */
/* ----------------------------------------------------------------*/
/* 2018-12-14 Новое ядро                                           */
/*=================================================================*/
--
CREATE DATABASE db_k WITH OWNER = postgres ENCODING = 'UTF8'
  TABLESPACE = pg_default LC_COLLATE = 'ru_RU.UTF-8' LC_CTYPE = 'ru_RU.UTF-8' CONNECTION LIMIT = -1;
--
