/*==================================================================================*/
/* DBMS name:      PostgreSQL 8                                                      */
/* Created on:     10.02.2015 18:25:11                                               */
/*    2015-03-21 Появился частичный индекс на кратком коде                           */
/*    29.03.2015 18:19:37 Добавлен объект                                            */
/*    28.04.2015 Изменена иерархия объектов                                          */
/* --------------------------------------------------------------------------------- */                                                               
/* 2015-05-28:  Добавлены атрибуты в Кодификатор                                     */                                                                
/*    Дата создания              date_create                                         */        
/*    Дата начала актуальности   date_from                                           */
/*    Дата конца актуальности    date_to                                             */
/*    UUID                       codif_uuid                                          */
/*              Добавлена nso_domain_column                                          */ 
/* 2015-06-05:  Добавлен атрибут impact_type d таблицу nso_domain_column_hist        */
/* --------------------------------------------------------------------------------- */
/* 22.06.2015 15:15:34  obj_codifier, obj_object, nso_domain_column имеют            */
/*                      историю.                                                     */ 
/* ----------------------------------------------------------------------------------*/
/* Nick 2015-10-01 Кодификатор допускает одинаковые имена в различных ветках.        */
/*      add CONSTRAINT ak2_obj_codifier UNIQUE (codif_name, parent_codif_id)         */
/* ----------------------------------------------------------------------------------*/
/* Nick 2015-10-02 Добавлена таблица "Конфигурация ПТК"                              */
/* Nick 2015-11-16  Добавлен атрибуты: "Объект-домен", "Тип объекта-потомка".        */
/* --------------------------------------------------------------------------------- */
/* Nick 2015-12-30  Убрано                                                           */ 
/*     ALTER TABLE com_ptk_config ADD CONSTRAINT ak2_com_ptk_config UNIQUE (ptk_uuid)*/ 
/* 2016-02-03 Экспорт в XML, добавлены новые типы.                                   */ 
/* Добавлены воздействия D и E --                                                    */
/* Добавлены воздействия F и G -- 2016-01-26 Gregory                                 */
/* --------------------------------------------------------------------------------- */
/*  2016-06-19 Nick  Дополнительный атрибут в NSO_DOMAIN_COLUMN, nso_code            */
/* --------------------------------------------------------------------------------- */
/* 2016-11-07 Nick  Общая последовательность для исторических таблиц и LOG.          */
/*      Все LOG таблицы наследуют от "ALL_LOG". Удалена "Конфигурация ПТК.           */
/* --------------------------------------------------------------------------------- */
/* 2016-11-11 Nick  Ревизия структуры исторических таблиц.                           */
/* 2016-12-02 Nick  Добавлены события, связанные с конфигурацией ПТК                 */   
/* --------------------------------------------------------------------------------- */
/* 2017-01-25 Nick  Impact_descr типа t_text                                         */
/* --------------------------------------------------------------------------------- */
/* 2017-02-18 Nick  obj_owner_id - опциональный атрибут                              */
/* --------------------------------------------------------------------------------- */
/* 2017-02-23 Nick  Поисковый индекс по obj_owner_id.                                */
/* 2017-03-01 Nick  Все дочерние id_log не имеют ограничения NOT NULL                */
/* --------------------------------------------------------------------------------- */
/* 2017-12-01 Nick  Дополнительные индексы.  Тип объекта и времена                   */
/* 2017-12-10 Nick  Мелкие доделки. Удаление DEFAULT  в исторических таблицах.       */
/* --------------------------------------------------------------------------------- */
/* 2017-12-18 Nick  Предприятие-владелец UUID из НСО                                 */
/* --------------------------------------------------------------------------------- */
/* 2018-01-18 Nick  Нет собственных атрибутов у LOG-таблиц-наследников.              */
/* 2018-02-02 Nick  Последовательность com.com_log_id_log_seq                        */
/*                                                       только для utl_match_order  */
/* --------------------------------------------------------------------------------- */
/*  2018-12-15 Nick Новое ядро                                                       */
/* --------------------------------------------------------------------------------- */
/*  2019-05-20 Nick Имя схемы в LOG таблицах стало типа t_sysname                    */
/*  2020-04-07 Nick Не забывать про установку имени схемы (по умолчанию) в LOG-табл. */
/* ----------------------------------------------------------------------------------*/
/* Nick 2020-04-30 Журнал и obj_object - секционируются.                             */
/*           Журнал - декларативное секционирование,                                 */
/*           obj_object - секционирование наследованием.                             */
/*===================================================================================*/
SET search_path=com, public, pg_catalog;

-- Декларативное секционирование журнала - продолжение.

CREATE TABLE com.com_log_1_19 PARTITION OF com.com_log_1
       FOR VALUES FROM ('2019-01-01 00:00:00') TO ('2019-12-31 23:58:50')
    PARTITION BY LIST (impact_type);   
COMMENT ON TABLE com.com_log_1_19 IS 'Схема COM. Журнал регистрации операций и ошибок. 2019 год';
--
CREATE TABLE com.com_log_1_20 PARTITION OF com.com_log_1
       FOR VALUES FROM ('2020-01-01 00:00:00') TO ('2020-12-31 23:58:50')
    PARTITION BY LIST (impact_type);
COMMENT ON TABLE com.com_log_1_20 IS 'Схема COM. Журнал регистрации операций и ошибок. 2020 год';
--      
CREATE TABLE com.com_log_1_19_op PARTITION OF com.com_log_1_19 
       FOR VALUES IN ('0','1','2','3','4','5','6','7','Q','8','9','A','B','C','D','E','F','G');
COMMENT ON TABLE com.com_log_1_19_op IS 'Схема COM. Журнал регистрации операций. 2019 год';
-- 
CREATE TABLE com.com_log_1_19_er PARTITION OF com.com_log_1_19 FOR VALUES IN ('!');
COMMENT ON TABLE com.com_log_1_19_er IS 'Схема COM. Журнал регистрации ошибок. 2019 год';
--      --
CREATE TABLE com.com_log_1_20_op PARTITION OF com.com_log_1_20 
       FOR VALUES IN ('0','1','2','3','4','5','6','7','Q','8','9','A','B','C','D','E','F','G');
COMMENT ON TABLE com.com_log_1_20_op IS 'Схема COM. Журнал регистрации операций. 2020 год';
       -- 
CREATE TABLE com.com_log_1_20_er PARTITION OF com.com_log_1_20 FOR VALUES IN ('!');
COMMENT ON TABLE com.com_log_1_20_er IS 'Схема COM. Журнал регистрации ошибок. 2020 год';
            
