SELECT * FROM gar_tmp.adr_area_type ORDER BY id_area_type;
INSERT INTO gar_tmp.adr_area_type (
      id_area_type
     ,nm_area_type
     ,nm_area_type_short
     ,pr_lead
)
VALUES (  143
         ,'Животноводческая точка'
         ,'жт'
         ,0 
)
,(  144
   ,'Ферма'
   ,'ферма' 
   ,0
);

SELECT * FROM gar_fias.as_addr_obj_type WHERE (id IN (135,208));
SELECT * FROM gar_fias.as_addr_obj_type WHERE (lower(type_name) IN ('животноводческая точка','ферма'));
--------------------------------------------------------------------------------------------------------
-- 135|'8'|'Животноводческая точка'|'жт'|'Животноводческая точка'|'1900-01-01'|'1900-01-01'|'2015-11-05'|t
-- 208|'8'|'Ферма'|'ферма'|'Ферма'|'1900-01-01'|'1900-01-01'|'2015-11-05'|t
-- 364|'16'|'Животноводческая точка'|'жт'|'Животноводческая точка'|'1900-01-01'|'1900-01-01'|'2015-12-31'|t
-- 411|'16'|'Ферма'|'ферма'|'Ферма'|'1900-01-01'|'1900-01-01'|'2015-12-31'|t
