-- -----------------------------------------------------------------------------
--  2023-11-15  Справочники адресных пространств и улиц пересекаться не должны.
-- -----------------------------------------------------------------------------
--  Базы: unsi_test_05, unsi_test_50

 BEGIN;  -- Адресные пространства
   DELETE FROM gar_tmp.xxx_adr_area_type WHERE id_area_type IN (
        42	-- Разъезд
      , 85	-- Аллея
      , 87	-- Бульвар
      , 88	-- Вал
      , 89	-- Въезд
      , 91	-- Дорога
      , 92	-- Заезд
      , 96	-- Кольцо
      , 97	-- Линия
      ,104	-- Переезд
      ,108	-- Просек
      ,109	-- Просека
      ,110	-- Проспект
      ,112	-- Проулок
      ,114	-- Спуск
      ,115	-- Сквер
      ,130	-- Тракт
      ,131	-- Тупик
      ,134	-- Шоссе
 );

 SELECT * FROM gar_tmp.xxx_adr_area_type ORDER BY id_area_type;
 --  ROLLBACK;
 COMMIT;  
--
 BEGIN;
   DELETE  FROM gar_tmp.xxx_adr_street_type WHERE ( id_street_type IN (
            4  -- Берег
          ,12  -- Квартал
          ,14  -- Коса
          ,16  -- Микрорайон
          ,18  -- Парк
          ,30  -- Сад
          ,33  -- Станция
          ,34  -- Территория
          ,41  -- Платформа
          ,42  -- Километр
          ,43  -- Городок
          ,44  -- Гаражно-строительный кооп.
          ,45  -- Казарма
          ,46  -- Местечко
          ,47  -- Остров
          ,49  -- Дачное неком-е партнерство   
          ,53  -- Некоммерческое партнерство
          ,54  -- Планировочный район
          ,56  -- Территория ДНТ
     )
   );  
                 
  SELECT * FROM gar_tmp.xxx_adr_street_type ORDER BY id_street_type; 
  -- ROLLBACK;  
 COMMIT;  
