{ 
  "nso_object":
 [
    "nso_code":""        /*  Код НСО                  */
   ,"nso_name":""        /*  Наименование НСО         */
   ,"nso_uuid":""        /*  UUID НСО                 */
   ,"parent_nso_code":"" /*  Код родительского НСО    */
   ,"nso_type_code":""   /*  Тип НСО                  */
   ,"is_group_nso":""    /*  Признак узлового НСО     */
   ,"date_from":""       /*  Дата начала актуальности */
   ,"date_to":""         /*  Дата конца актуальности  */
   ,"unique_control":""  /*  Признак уникальности     */
   ,"view_create":""     /*  Создание технического представления */
, "columns":
  [
    {
       "number_col":""     /*  Номер колонки,  если NULL - то номер вычисляется по максимальному */
      ,"act_code":""       /*  Актуальный код, если NULL то берём код родителя +  код НСО + номер строки */
      ,"act_name":""       /*  Актуальное имя, если NULL - берём имя домена */
      ,"attr_code":""      /*  Код атрибута */
      ,"default_value":""  /*  Значение по умолчанию */
      ,"is_mandatory ":""  /*  Обязательность заполнения */
    }
  ,
   {
      "number_col":""     
     ,"act_code":""       
     ,"act_name":""       
     ,"attr_code":""      
     ,"default_value":""  
     ,"is_mandatory ":""  
   }
  ]
, "marks_keys":
  [
  ,"key_type_code":"" /* Тип кода ключа */
  ,"attr_codes":    /* Массив кодов атрибутов, образующих ключ */
      [
         ""
        ,""
      ]
  ]
 ]
}