SELECT * FROM public.zz5
WHERE (fias_guid IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); -- ++
--
select * from gar_tmp_pcg_trans.f_xxx_adr_area_show_data ()
where (fias_guid  
IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); -- ++
--
select * from gar_tmp.xxx_adr_area where (fias_guid  
IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); -- ++

--id_addr_obj|id_addr_parent|fias_guid                           |parent_fias_guid                    |nm_addr_obj|addr_obj_type_id|addr_obj_type|obj_level|level_name                  |region_code|area_code|city_code|place_code|plan_code|street_code|oper_type_id|oper_type_name|start_date|end_date  |tree_d                   |level_d|
-------------+--------------+------------------------------------+------------------------------------+-----------+----------------+-------------+---------+----------------------------+-----------+---------+---------+----------+---------+-----------+------------+--------------+----------+----------+-------------------------+-------+
--      77839|         75729|3be41afe-4ae9-4a1b-8e22-9990e07ee7ff|6a5b8826-dc74-4694-bbba-776daa464be1|Мостовая   |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |31        |0        |15         |          10|Добавление    |2013-04-09|2079-06-06|{78545,78727,75729,77839}|      4|
--      81320|         75729|8d58ca8c-a65a-4370-a5d4-584f44ac5b73|6a5b8826-dc74-4694-bbba-776daa464be1|Фруктовая  |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |31        |0        |1          |          10|Добавление    |2013-07-24|2079-06-06|{78545,78727,75729,81320}|      4|
--      81431|         75740|e31d0897-8a46-48d3-a213-7ae993c50de9|0f617717-1040-4742-bfb2-0eaaa040d4fa|Благородная|             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |32        |0        |2          |          10|Добавление    |2013-07-24|2079-06-06|{78545,78727,75740,81431}|      4|
--      81458|         75740|7248f5e2-99b1-47e2-a5e4-190ea89df774|0f617717-1040-4742-bfb2-0eaaa040d4fa|Ломаная    |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |32        |0        |3          |          10|Добавление    |2013-04-09|2079-06-06|{78545,78727,75740,81458}|      4|
--      81776|         75740|64198789-a489-45d9-a15b-111f58d9009a|0f617717-1040-4742-bfb2-0eaaa040d4fa|Финиковая  |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |32        |0        |10         |          10|Добавление    |2013-07-09|2079-06-06|{78545,78727,75740,81776}|      4|
--      80724|         75761|5b8bba72-59a1-4e73-b917-848e7dd36c32|0e4ebdbe-e302-4237-94db-0c168f22b5db|Ахульго    |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |33        |0        |2          |          10|Добавление    |2013-05-31|2079-06-06|{78545,78727,75761,80724}|      4|
--      80792|         75761|354baa65-215d-4df5-aec0-1b6dbfada0c9|0e4ebdbe-e302-4237-94db-0c168f22b5db|Пшеничная  |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |33        |0        |4          |          10|Добавление    |2013-05-31|2079-06-06|{78545,78727,75761,80792}|      4|
--      81169|         75761|89e7b4b0-aa0c-4977-b631-79709c13a773|0e4ebdbe-e302-4237-94db-0c168f22b5db|Шиназская  |             204|ул           |        8|Элемент улично-дорожной сети|5          |0        |1        |33        |0        |14         |          10|Добавление    |2013-05-31|2079-06-06|{78545,78727,75761,81169}|      4|

select * from gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '6a5b8826-dc74-4694-bbba-776daa464be1'::uuid);  -- НЕТ
select * from gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '0f617717-1040-4742-bfb2-0eaaa040d4fa'::uuid);  -- НЕТ
select * from gar_tmp_pcg_trans.f_adr_area_get ('gar_tmp', '0e4ebdbe-e302-4237-94db-0c168f22b5db'::uuid);  -- НЕТ 
-----------------------------------------------------------------------------------------------------------------

select * from gar_tmp_pcg_trans.f_xxx_adr_area_show_data ()
where (fias_guid  
IN ('6a5b8826-dc74-4694-bbba-776daa464be1'
,'0f617717-1040-4742-bfb2-0eaaa040d4fa'
,'0e4ebdbe-e302-4237-94db-0c168f22b5db'
)); -- НЕТ

SELECT id, object_id, object_guid, change_id, object_name, type_id, type_name, obj_level, oper_type_id, prev_id, next_id, update_date, start_date, end_date, is_actual, is_active
FROM gar_fias.as_addr_obj 
where (
object_guid
IN ('6a5b8826-dc74-4694-bbba-776daa464be1'
,'0f617717-1040-4742-bfb2-0eaaa040d4fa'
,'0e4ebdbe-e302-4237-94db-0c168f22b5db'
));

--|object_id|object_guid                         |change_id|object_name|type_id|type_name|obj_level|o
--+---------+------------------------------------+---------+-----------+-------+---------+---------+-
--|    75729|6a5b8826-dc74-4694-bbba-776daa464be1|   214539|Локомотив  |     79|кв-л     |        6| 
--|    75729|6a5b8826-dc74-4694-bbba-776daa464be1|   214529|Локомотив  |     55|д        |        6| ++  Почему они потерялись.
--|    75740|0f617717-1040-4742-bfb2-0eaaa040d4fa|   214567|Садовод    |     79|кв-л     |        6| ++
--|    75761|0e4ebdbe-e302-4237-94db-0c168f22b5db|   214694|Урожай     |     79|кв-л     |        6| ++
--|    75761|0e4ebdbe-e302-4237-94db-0c168f22b5db|   214660|Уроай      |     79|кв-л     |        6| 


SELECT * FROM gar_tmp.xxx_adr_area where (
fias_guid
IN ('6a5b8826-dc74-4694-bbba-776daa464be1'
,'0f617717-1040-4742-bfb2-0eaaa040d4fa'
,'0e4ebdbe-e302-4237-94db-0c168f22b5db'
)); -- нет, не прошли интеграцию      <=============================  G31_work_tbl_check.sqlМне очень приятно

select * from gar_tmp_pcg_trans.f_xxx_obj_fias_show_data_1 ('gar_tmp')
where (obj_guid  
IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); -- ++++

SELECT id_obj, id_obj_fias, obj_guid, type_object, tree_d, level_d
FROM gar_tmp.xxx_obj_fias 
where (obj_guid  
IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); --

--id_obj|id_obj_fias|obj_guid                            |type_object|tree_d                   |level_d|
--------+-----------+------------------------------------+-----------+-------------------------+-------+
--      |      80792|354baa65-215d-4df5-aec0-1b6dbfada0c9|          1|{78545,78727,75761,80792}|      4|
--      |      77839|3be41afe-4ae9-4a1b-8e22-9990e07ee7ff|          1|{78545,78727,75729,77839}|      4|
--      |      80724|5b8bba72-59a1-4e73-b917-848e7dd36c32|          1|{78545,78727,75761,80724}|      4|
--      |      81776|64198789-a489-45d9-a15b-111f58d9009a|          1|{78545,78727,75740,81776}|      4|
--      |      81458|7248f5e2-99b1-47e2-a5e4-190ea89df774|          1|{78545,78727,75740,81458}|      4|
--      |      81169|89e7b4b0-aa0c-4977-b631-79709c13a773|          1|{78545,78727,75761,81169}|      4|
--      |      81320|8d58ca8c-a65a-4370-a5d4-584f44ac5b73|          1|{78545,78727,75729,81320}|      4|
--      |      81431|e31d0897-8a46-48d3-a213-7ae993c50de9|          1|{78545,78727,75740,81431}|      4| 
--
SELECT * FROM gar_tmp.xxx_adr_street_gap;
----------------------------
--_street|nm_street          |nm_street_full     |id_street_type|nm_street_type|id_area|nm_fias_guid_area                   |nm_fias_guid                        |kd_kladr|tree_d                         |level_d|obj_level|level_name                  |oper_type_id|oper_type_name                                       |curr_date |check_kind|
-------+-------------------+-------------------+--------------+--------------+-------+------------------------------------+------------------------------------+--------+-------------------------------+-------+---------+----------------------------+------------+-----------------------------------------------------+----------+----------+
--  76262|Дружба СНТ Линия 8 |Дружба СНТ Линия 8 |           130|ж/д_оп        |  79074|a8695cce-c623-4451-bb47-2d69ab22092a|89e1771a-9b22-4fe9-9dd4-d4bdd37c2906|        |{78545,79074,76262}            |      3|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-09-21|0         |
--  83443|Акая Акбулатова    |Акая Акбулатова    |           113|а/я           |  83543|d16a1b87-8a78-4c05-aec9-53087f7074e3|66641bf7-2f1f-4d78-b17e-71bfbfa1c995|        |{78545,78727,74652,83543,83443}|      5|        8|Элемент улично-дорожной сети|          51|Переподчинение вследствие переподчинения вышестоящего|2023-10-06|0         |
--  79734|РНС Маяк           |РНС Маяк           |           194|снт           |  79429|f7b4a80c-a6ba-4e9c-9279-ca11150f0924|ca79c14d-3770-4c55-91d0-fbb4561e509b|        |{78545,78727,79429,79734}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  81612|Доктор             |Доктор             |           194|снт           |  80412|2cd50151-d2c0-4b9f-b3fd-3a6734c47cc0|ee68df6c-6e49-469b-8fc1-ccba3ed6cbda|        |{78545,78727,80412,81612}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  80868|Красная роза       |Красная роза       |           194|снт           |  85200|9a8e9141-6ecd-4dc0-a449-363ce08203f3|f8cc583a-1e69-4ce0-944c-da6bdd4c110e|        |{78545,78727,85200,80868}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  78055|Центральная усадьба|Центральная усадьба|           158|п             |  78772|b10ca6a7-e9c0-4382-b939-4787aaf43a58|0755bd9b-93bf-490a-a99d-76aebba0b5b9|        |{78545,78772,78055}            |      3|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  75585|Серный             |Серный             |           158|п             |  78958|bf14786f-6c0e-4369-8907-57f9d3fd93ac|97299168-9004-412a-ae9c-558d4356c606|        |{78545,78958,75585}            |      3|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  75587|Приморский         |Приморский         |           158|п             |  78958|bf14786f-6c0e-4369-8907-57f9d3fd93ac|43c3311c-9cc2-494c-8065-98f62396d78c|        |{78545,78958,75587}            |      3|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  79196|Рыбный             |Рыбный             |           158|п             |  78958|bf14786f-6c0e-4369-8907-57f9d3fd93ac|ccb32695-884a-4961-8bd7-c9e5a356f9ad|        |{78545,78958,79196}            |      3|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  84391|Старая             |Старая             |           150|местность     |  82604|9c8e4958-4f0d-4ad6-8937-d71af6dcd9d5|58f733ae-fda3-4cf1-8f77-52409f62bc6e|        |{78545,80327,82604,84391}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  84545|Новострой          |Новострой          |           150|местность     |  82604|9c8e4958-4f0d-4ad6-8937-d71af6dcd9d5|c07a62d5-8ea3-47a6-b989-6f88b0a99429|        |{78545,80327,82604,84545}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  84258|Хьарша             |Хьарша             |           150|местность     |  85292|264e6fff-ee5c-4e6f-adaa-73c123b4ef91|efbb0998-3d73-4071-9ccb-09a86c293b86|        |{78545,80327,85292,84258}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  84464|Дайша              |Дайша              |           150|местность     |  85292|264e6fff-ee5c-4e6f-adaa-73c123b4ef91|214ae2fd-7d99-43b5-8488-eb849d00629d|        |{78545,80327,85292,84464}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  84504|Хъарша             |Хъарша             |           150|местность     |  85292|264e6fff-ee5c-4e6f-adaa-73c123b4ef91|3197392a-8889-431d-b162-3f44fa2c0b56|        |{78545,80327,85292,84504}      |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  88476|Будка              |Будка              |           130|ж/д_оп        |  91406|6b2fa809-1eac-419a-b744-a12a97e4a635|a3a2bbec-06a8-4f14-9a89-665b4fa75b95|        |{78545,91280,91406,88476}      |      4|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  96607|Привольный         |Привольный         |           158|п             |  98841|87de347a-61ad-4a60-9646-14e4b3ee79cd|f2f1d515-8536-4442-b44d-2544c5c39e95|        |{78545,98621,98841,96607}      |      4|        8|Элемент улично-дорожной сети|           1|Инициация                                            |2023-10-06|0         |
--  90701|Акъ-таш            |Акъ-таш            |           150|местность     | 139504|0f96936a-ecd6-4a64-a4c3-2646c2a1d2aa|f447f6c0-5d94-4033-b72a-4116bcc08a6b|        |{78545,139302,139504,90701}    |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |
--  90718|Баъли-бав          |Баъли-бав          |           150|местность     | 139504|0f96936a-ecd6-4a64-a4c3-2646c2a1d2aa|fc826836-3d68-465e-a176-ffa0568bceec|        |{78545,139302,139504,90718}    |      4|        8|Элемент улично-дорожной сети|          10|Добавление                                           |2023-10-06|0         |

--
SELECT * FROM gar_tmp_pcg_trans.f_street_type_get ('gar_tmp', 204);  -- 38 ул
SELECT * FROM gar_tmp.xxx_adr_street_type WHERE (204 = ANY (fias_ids));
gar_tmp_pcg_trans.f_adr_area_get (p_schema_etl, _data.nm_fias_guid_area);

select * from gar_tmp.adr_street as2 where (as2.nm_fias_guid -- нет их
IN (
            '354baa65-215d-4df5-aec0-1b6dbfada0c9'
           ,'3be41afe-4ae9-4a1b-8e22-9990e07ee7ff'
           ,'5b8bba72-59a1-4e73-b917-848e7dd36c32'
           ,'64198789-a489-45d9-a15b-111f58d9009a'
           ,'7248f5e2-99b1-47e2-a5e4-190ea89df774'
           ,'89e7b4b0-aa0c-4977-b631-79709c13a773'
           ,'8d58ca8c-a65a-4370-a5d4-584f44ac5b73'
           ,'e31d0897-8a46-48d3-a213-7ae993c50de9'
 )
); --Нет их ----

--
-- 2023-10-20
--
TRUNCATE TABLE gar_tmp.xxx_adr_area;
SELECT gar_tmp_pcg_trans.f_xxx_adr_area_set_data (); 
/*
-----------------------------------------------------
f_xxx_adr_area_set_data|
-----------------------+
                  26520|
*/
------------------------
SELECT gar_tmp_pcg_trans.f_xxx_obj_fias_set_data ('gar_tmp', 'gar_tmp', 'gar_tmp', 'gar_tmp');
