-- ===================================================================
--  2023-04-06  Очередь событий.
--  2023-04-29  Модификация, наследование
--  2023-05-13  Модификация, 10+10
--  2023-11-27  Модификация, l0 - параметры последнего процесса
-- ===================================================================
--
DROP TABLE IF EXISTS uio.event_l0 CASCADE;
CREATE TABLE uio.event_l0 () INHERITS (uio.event);
COMMENT ON TABLE uio.event_l0 IS 'Контекст workers L0 (Завершающий)';
--
-- SELECT * FROM uio.event_l0;
--
