#!/bin/bash
# ----------------------------------------------------------------- 
#  2023-06-30 Nick. Постобработка, финальная стадия
# ----------------------------------------------------------------- 
if [ $# -ne 2 ]
  then
     echo Использование: post_proc.sh \<Path\> \<Updates-dir\>  
     exit 1
fi

## ----------------------------------------------------- ##
##     Общие переменные устанавливать только вручную     ##
## ----------------------------------------------------- ##
TD=/tmp  # Рабочий каталог, сюда должен попасть архив с обновлениямим
WD=$(pwd)

cd $1

sudo chown -R n.chadaev $2
if [ $? -ne 0 ] 
  then
        echo 1.Ошибка при изменении Владельца
        exit 1
fi

sudo chgrp -R 'domain users' $2
if [ $? -ne 0 ] 
  then
        echo 2.Ошибка при изменении Группы
        exit 2
fi

tar -cvz $2 > $2.tar.gz
if [ $? -ne 0 ] 
  then
        echo 3.Ошибка при создании архива
        exit 3
fi

md5sum $2.tar.gz > $2.tar.gz.md5
if [ $? -ne 0 ] 
  then
        echo 4.Ошибка при вычислении md5sum
        exit 4
fi

cp -v $2.tar.gz* $TD/.
if [ $? -ne 0 ] 
  then
        echo 5.Ошибка при копировании файлов
        exit 5
fi

cd $WD
echo 6.Выполнен процесс
echo

