--
--  2023-06-08
--
BEGIN;
COMMIT;
ROLLBACK;

INSERT INTO fiscalization.fsc_org (
             dt_create
           , inn
           , nm_org_name
           , org_type
           , org_status
           , bik
           , nm_org_address
           , nm_org_phones
)
  VALUES 
          ( now ()
          , '5037008735'
          , 'ООО МосОблЕИРЦ'
          , 1
          , TRUE
          , NULL
          , '140002, Московская область, г. Люберцы, ул. Новая, д. 9А'
          , ARRAY['+7 (499) 444-01-00','8 (800) 555-07-69']
 )
 ,
   ( now ()
   , '7734202860'
   , 'ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК'
   , 5
   , TRUE
   , '044525659'
   , '123060, г. Москва, ул. Маршала Соколовского, д. 1'
   , ARRAY['+7 (495) 777-48-88', '8 (800)-100-48-88']
 )
 , ( now()
   ,'7707083893'
   ,'ПАО Сбербанк г. Москва'
   ,5
   ,TRUE
   ,'044525225'
   ,'117997, г. Москва, ул. Вавилова, д.19'
   , ARRAY['+7 (495) 500-55-50', '+7 (495) 957-58-62']
 )
 , ( now()
    , '7707083893'
    , 'Среднерусский банк СБ РФ г. Москва'
    , 5
    , TRUE
    ,'044525225'
    ,'109544, Г МОСКВА, БОЛЬШАЯ АНДРОНЬЕВСКАЯ УЛ, Д 8'
    , ARRAY['+7 (495) 747-34-31']
 )   
 , ( now ()
    ,'7831000122'
    ,'Центральный филиал АБ "РОССИЯ" г. Москва'
    ,5
    ,TRUE
    ,'044525112'
    ,'121069, Москва, Мерзляковский пер., д. 18, стр. 2'
    ,ARRAY['8 (800) 100-11-11', '+7 (812) 335-85-00']
 )
 ,
 ( now()
  , '7710140679'
  , 'АО "Тинькофф Банк" г. Москва'
  , 5
  , TRUE
  , '044525974'
  , '127287, г. Москва, ул. Хуторская 2-я, д. 38А, стр. 26'
  , ARRAY ['8 (800) 700-66-66']
 )
 
 , ( now()
      , '9721194461'
      , 'ООО "Банк Точка" г. Москва'
      , 5
      , TRUE
      , NULL
      , '109240, город Москва, ул. Верхняя Радищевская, д. 2/1, стр. 5, пом. I, эт 3, ком 4'
      , ARRAY['8 (800) 200-00-24']
 )
 , ( now()
    , '6608008004'
    , 'ПАО КБ "УБРИР" г. Екатеринбург'
    , 5
    , TRUE
    , '046577795'
    , '620014, Российская Федерация, Свердловская область, г. Екатеринбург, ул. Сакко и Ванцетти, 67'
    , ARRAY ['8 (800) 100-02-00', '8 (800) 700-59-59']
 )
 , ( now()
     , '7706092528'
     , 'Точка ПАО Банка "ФК Открытие" г. Москва'
     , 5
     , TRUE
     , '044525999'
     , '109240, гМосква, улица Верхняя Радищевская, дом 2/1, строение 3'
     , ARRAY ['8 (800) 200-00-24','+7 (495) 221-32-10']
 )
 , ( now()
    , '7707083893'
    , 'КРАСНОЯРСКОЕ ОТДЕЛЕНИЕ N 8646 ПАО СБЕРБАНК г. Красноярск' 
    , 5
    , TRUE
    , '044525225'
    , '660028, г Красноярск, пр-кт Свободный, д. 46'
    , ARRAY ['8 (800) 555-55-50']
   )
 ,( now()
   , '7702070139'
   , 'Филиал ЛС 7701 Банка ВТБ (ПАО) г. Москва'
   , 5
   , TRUE
   , '044525745'
   , '107031, Москва, ул. Кузнецкий мост, д.17, стр. 1'
   , ARRAY['+7 (495) 925-80-00']
  )
 ,( now()
    , '7702070139'
    , 'ФИЛИАЛ ЛС 3652 БАНКА ВТБ (ПАО) г. Воронеж'
    , 5
    , TRUE
    , '042007855'
    , '394030, Воронеж, ул Кольцовская, 31'
    , ARRAY ['+7 (473) 235-60-00']
  )
  ,( now()
    , '7702070139'
    , 'ФИЛИАЛ ЛС 2754 БАНКА ВТБ (ПАО) г. Хабаровск'
    , 5
    , TRUE
    , '040813713'
    , '680000, Хабаровск, ул. Муравьёва - Амурского, д. 18, пом. 0, 1'
    , ARRAY ['+7 (4212) 45-54-55']
  )
;
-- SELECT * FROM fiscalization.fsc_org WHERE (id_org >= 125);
-- DELETE FROM fiscalization.fsc_org WHERE (id_org >= 126);
-- UPDATE fiscalization.fsc_org SET

--    dt_update  = now()
--  , inn            = '5037008735'
--  , nm_org_name    = 'ООО МосОблЕИРЦ'
--  , nm_org_address = '140002, Московская область, г. Люберцы, ул. Новая, д. 9А'
--  , nm_org_phones  = array['+7 (499) 444-01-00','+7 (800) 555-07-69']
 
-- WHERE (id_org = 125); 
 
  
