--
--   2023-10-31  Тестирование.
--
BEGIN;
   SELECT * FROM gar_fias_pcg_load.f_addr_area_show_data (p_fias_guid := NULL::uuid, p_qty := 1);  -- 10
--------------------------------------------------------------------------------------------------------
-- 2457|2157|'cf29e918-e413-4f6c-8391-148176db582d'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Победа'|90|'п'|6|'Населенный пункт'|'1'|'4'|'0'|'37'|'0'|'0'|7041|2666|20|'Изменение'|'2015-02-03'|'2079-06-06'|2457|'{11,2157,2457}'|3
-- 2405|2157|'294468ce-fb2c-4422-9765-0b8b0d6026f6'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Победа'|90|'п'|6|'Населенный пункт'|'1'|'4'|'0'|'36'|'0'|'0'|6657|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|2457|'{11,2157,2405}'|3
-- 2216|2157|'5c8405c9-b73a-44e1-b82c-acf8211873be'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Веселый'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'4'|'0'|'0'|6154|2387|20|'Изменение'|'2019-09-26'|'2079-06-06'|2416|'{11,2157,2216}'|3
-- 2416|2157|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Веселый'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'5'|'0'|'0'|6814|2623|20|'Изменение'|'2019-06-28'|'2079-06-06'|2416|'{11,2157,2416}'|3
-- 2136|2157|'01c0f03e-bd21-4ce8-86a2-9ae3259143fe'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Грозный'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'9'|'0'|'0'|5895|2295|20|'Изменение'|'2019-09-26'|'2079-06-06'|2556|'{11,2157,2136}'|3
-- 2556|2157|'96fe8f29-c1e6-43d7-a1d7-f327bef75c63'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Грозный'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'8'|'0'|'0'|7376|2776|20|'Изменение'|'2019-09-26'|'2079-06-06'|2556|'{11,2157,2556}'|3
-- 2639|2416|'31295a7b-1277-4b82-a40c-6be7d0cbd850'|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'А/Д Подъезд к х. Веселый'|127|'дор'|8|'Элемент улично-дорожной сети'|'1'|'4'|'0'|'4'|'0'|'10'|7517|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|3662|'{11,2157,2416,2639}'|4
-- 3662|2416|'096cf142-7d31-428e-8b43-095bfa1c1670'|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'А/Д Подъезд к х. Веселый'|127|'дор'|8|'Элемент улично-дорожной сети'|'1'|'4'|'0'|'5'|'0'|'12'|11198|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|3662|'{11,2157,2416,3662}'|4
-- 4807|4591|'145949fd-0aa4-4bad-8c83-3b6701972716'|'a8cf3eb8-4689-4981-b908-9a760aae99d5'|'Кочкин'|112|'х'|6|'Населенный пункт'|'1'|'6'|'0'|'13'|'0'|'0'|15171|5343|20|'Изменение'|'2019-12-05'|'2079-06-06'|4813|'{11,4591,4807}'|3
-- 4813|4591|'29fe3efe-8f3a-4a61-bf98-481e3acca90e'|'a8cf3eb8-4689-4981-b908-9a760aae99d5'|'Кочкин'|112|'х'|6|'Населенный пункт'|'1'|'6'|'0'|'12'|'0'|'0'|15149|5298|20|'Изменение'|'2015-02-03'|'2079-06-06'|4813|'{11,4591,4813}'|3
--------------------------------------------------------------------------------------------------------
SELECT * FROM gar_fias_pcg_load.f_addr_area_set_data ( 
       p_fias_guid  := NULL::uuid     
      ,p_qty        := 1
      ,p_descr      := 'ТЕСТ. Адыгея'   
);      --  10  

SELECT * FROM gar_fias.gap_adr_area WHERE (date_create = current_date) ORDER BY nm_addr_obj; -- 10
-------------------------------------------------------------------------------------------------- 
-- 2639|2416|'31295a7b-1277-4b82-a40c-6be7d0cbd850'|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'А/Д Подъезд к х. Веселый'|127|'дор'|8|'Элемент улично-дорожной сети'|'1'|'4'|'0'|'4'|'0'|'10'|7517|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|3662|'{11,2157,2416,2639}'|4|'2023-11-02'|'ТЕСТ. Адыгея'
-- 3662|2416|'096cf142-7d31-428e-8b43-095bfa1c1670'|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'А/Д Подъезд к х. Веселый'|127|'дор'|8|'Элемент улично-дорожной сети'|'1'|'4'|'0'|'5'|'0'|'12'|11198|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|3662|'{11,2157,2416,3662}'|4|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2216|2157|'5c8405c9-b73a-44e1-b82c-acf8211873be'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Веселый'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'4'|'0'|'0'|6154|2387|20|'Изменение'|'2019-09-26'|'2079-06-06'|2416|'{11,2157,2216}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2416|2157|'9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Веселый'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'5'|'0'|'0'|6814|2623|20|'Изменение'|'2019-06-28'|'2079-06-06'|2416|'{11,2157,2416}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2136|2157|'01c0f03e-bd21-4ce8-86a2-9ae3259143fe'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Грозный'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'9'|'0'|'0'|5895|2295|20|'Изменение'|'2019-09-26'|'2079-06-06'|2556|'{11,2157,2136}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2556|2157|'96fe8f29-c1e6-43d7-a1d7-f327bef75c63'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Грозный'|112|'х'|6|'Населенный пункт'|'1'|'4'|'0'|'8'|'0'|'0'|7376|2776|20|'Изменение'|'2019-09-26'|'2079-06-06'|2556|'{11,2157,2556}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 4807|4591|'145949fd-0aa4-4bad-8c83-3b6701972716'|'a8cf3eb8-4689-4981-b908-9a760aae99d5'|'Кочкин'|112|'х'|6|'Населенный пункт'|'1'|'6'|'0'|'13'|'0'|'0'|15171|5343|20|'Изменение'|'2019-12-05'|'2079-06-06'|4813|'{11,4591,4807}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 4813|4591|'29fe3efe-8f3a-4a61-bf98-481e3acca90e'|'a8cf3eb8-4689-4981-b908-9a760aae99d5'|'Кочкин'|112|'х'|6|'Населенный пункт'|'1'|'6'|'0'|'12'|'0'|'0'|15149|5298|20|'Изменение'|'2015-02-03'|'2079-06-06'|4813|'{11,4591,4813}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2457|2157|'cf29e918-e413-4f6c-8391-148176db582d'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Победа'|90|'п'|6|'Населенный пункт'|'1'|'4'|'0'|'37'|'0'|'0'|7041|2666|20|'Изменение'|'2015-02-03'|'2079-06-06'|2457|'{11,2157,2457}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
-- 2405|2157|'294468ce-fb2c-4422-9765-0b8b0d6026f6'|'e6b470db-a262-4aab-9ca0-2c5d0fc2209e'|'Победа'|90|'п'|6|'Населенный пункт'|'1'|'4'|'0'|'36'|'0'|'0'|6657|0|1|'Инициация'|'1900-01-01'|'2079-06-06'|2457|'{11,2157,2405}'|3|'2023-11-02'|'ТЕСТ. Адыгея'
--------------------------------------------------------------------------------------------
SELECT * FROM gar_fias_pcg_load.f_addr_obj_update_children() ORDER BY nm_addr_obj; -- 5
--------------------------------------------------------------------------------------------
-- '096cf142-7d31-428e-8b43-095bfa1c1670'|'31295a7b-1277-4b82-a40c-6be7d0cbd850'|'А/Д ПОДЪЕЗД К Х. ВЕСЕЛЫЙ'|127|0|8
-- '9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'5c8405c9-b73a-44e1-b82c-acf8211873be'|'ВЕСЕЛЫЙ'|112|0|6
-- '96fe8f29-c1e6-43d7-a1d7-f327bef75c63'|'01c0f03e-bd21-4ce8-86a2-9ae3259143fe'|'ГРОЗНЫЙ'|112|0|6
-- '29fe3efe-8f3a-4a61-bf98-481e3acca90e'|'145949fd-0aa4-4bad-8c83-3b6701972716'|'КОЧКИН'|112|4|6
-- 'cf29e918-e413-4f6c-8391-148176db582d'|'294468ce-fb2c-4422-9765-0b8b0d6026f6'|'ПОБЕДА'|90|0|6
--------------------------------------------------------------------------------------------
SELECT * FROM gar_fias.twin_addr_objects ORDER BY obj_level; -- 78
---------------------------------------------------------------------------------------------
-- '29fe3efe-8f3a-4a61-bf98-481e3acca90e'|'145949fd-0aa4-4bad-8c83-3b6701972716'|6|'2023-11-02'
-- '96fe8f29-c1e6-43d7-a1d7-f327bef75c63'|'01c0f03e-bd21-4ce8-86a2-9ae3259143fe'|6|'2023-11-02'
-- '9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'5c8405c9-b73a-44e1-b82c-acf8211873be'|6|'2023-11-02'
-- 'cf29e918-e413-4f6c-8391-148176db582d'|'294468ce-fb2c-4422-9765-0b8b0d6026f6'|6|'2023-11-02'
-- '096cf142-7d31-428e-8b43-095bfa1c1670'|'31295a7b-1277-4b82-a40c-6be7d0cbd850'|8|'2023-11-02'
---------------------------------------------------------------------------------------------


-- 2023-11-02
---------------------------------------------------------------------------------------------

ROLLBACK;

COMMIT;
select * from gar_fias.twin_addr_objects;
BEGIN;
ROLLBACK;
  SELECT * FROM gar_fias_pcg_load.f_addr_area_show_data (p_fias_guid := NULL::uuid, p_qty := 1) order by NM_ADDR_OBJ;

  
     INSERT INTO gar_fias.twin_addr_objects AS k(

                     fias_guid_new
                    ,fias_guid_old
                    ,obj_level  
                    ,date_create
     )
   --  EXPLAIN ANALYZE
     WITH z (   id_addr_obj
               ,id_addr_parent
               ,fias_guid
               ,nm_addr_obj
               ,addr_obj_type_id
               ,date_create
               ,id_lead
               ,obj_level
      ) AS 
        (
          -- Выбираю записи, принадлежание обрабатываемой дате.
          SELECT  x.id_addr_obj
                 ,x.id_addr_parent
                 ,x.fias_guid
                 ,upper(x.nm_addr_obj)
                 ,x.addr_obj_type_id
                 ,current_date
                 ,x.id_lead
                 ,x.obj_level
                
             FROM gar_fias_pcg_load.f_addr_area_show_data (p_fias_guid := NULL::uuid, p_qty := 1) x
           )
         
           SELECT DISTINCT ON (a.fias_guid, b.fias_guid)
                  a.fias_guid AS fias_guid_new
                , b.fias_guid AS fias_guid_old 
             --   , z.nm_addr_obj 
             --   , z.addr_obj_type_id              
                , z.obj_level
                , current_date
           FROM z
             JOIN z a ON (z.id_lead = a.id_addr_obj) AND  (z.date_create = a.date_create)
             JOIN z b ON (z.id_lead <> b.id_addr_obj) AND (b.date_create = z.date_create) AND
                                             (z.id_addr_parent = b.id_addr_parent)  AND
                                             (z.nm_addr_obj = upper(b.nm_addr_obj)) AND
                                             (z.addr_obj_type_id = b.addr_obj_type_id) 
           --ORDER BY z.nm_addr_obj;                                             
                                             
          ON CONFLICT ON CONSTRAINT pk_twin_adr_objects DO NOTHING;  

---------------------------------------------------------------------------------------------------
select * from gar_fias.twin_addr_objects;
-----------------------------------------------------------------------------------------------
-- '29fe3efe-8f3a-4a61-bf98-481e3acca90e'|'145949fd-0aa4-4bad-8c83-3b6701972716'|6|'2023-11-02'
-- '96fe8f29-c1e6-43d7-a1d7-f327bef75c63'|'01c0f03e-bd21-4ce8-86a2-9ae3259143fe'|6|'2023-11-02'
-- '9fd308f2-0ae8-4e9f-89cd-8dc833cdf415'|'5c8405c9-b73a-44e1-b82c-acf8211873be'|6|'2023-11-02'
-- 'cf29e918-e413-4f6c-8391-148176db582d'|'294468ce-fb2c-4422-9765-0b8b0d6026f6'|6|'2023-11-02'
-- '096cf142-7d31-428e-8b43-095bfa1c1670'|'31295a7b-1277-4b82-a40c-6be7d0cbd850'|8|'2023-11-02'
-- --------------------------------------------------------------------------------------------
                  SELECT   id_street
                          ,id_area
                          ,nm_street
                          ,id_street_type
                          ,nm_street_full
                          ,nm_fias_guid
                          ,dt_data_del
                          ,id_data_etalon
                          ,kd_kladr
                          ,vl_addr_latitude
                          ,vl_addr_longitude   
                          
                  FROM ONLY gar_tmp.adr_street
                        WHERE (nm_fias_guid = '29fe3efe-8f3a-4a61-bf98-481e3acca90e') 
                             AND (id_data_etalon IS NULL) AND (dt_data_del IS NULL);  
-
                  SELECT   id_street
                          ,id_area
                          ,nm_street
                          ,id_street_type
                          ,nm_street_full
                          ,nm_fias_guid
                          ,dt_data_del
                          ,id_data_etalon
                          ,kd_kladr
                          ,vl_addr_latitude
                          ,vl_addr_longitude   
                          
                  FROM ONLY gar_tmp.adr_street
                        WHERE (nm_fias_guid = '145949fd-0aa4-4bad-8c83-3b6701972716') 
                             AND (id_data_etalon IS NULL) AND (dt_data_del IS NULL);                              --                                              
