CREATE OR REPLACE FUNCTION public.newid ()
   RETURNS uuid AS 
   $$
-- --------------------------------------------------------------------------------------- --
--  2013-08-14 Nick                                                                        --            
--  Функция обёртка, аналог NEWID () в T-SQL.                                              --
--  Возвращает uuid сгенерированный по методу 4.                                           --   
--  Необходимо предварительно установить расширение  uuid-ossp-1.0                         --
--  SELECT * FROM newid();                                                                 --
--  -------------------------------------------------------------------------------------  --
--  2013-09-27 Функция будет создаваться в PUBLIC, создавать в pg_catalog - плохая идея.   --
--  -------------------------------------------------------------------------------------- -- 
      SELECT uuid_generate_v4();
   $$
    SECURITY INVOKER -- 2015-04-05 Nick
    STABLE LANGUAGE sql;

COMMENT ON FUNCTION public.newid () IS '42: Генерация UUID, метод random. Использует расширение uuid-osp';
--
-- SELECT * FROM newid ();
--
